[
  {
    "metadata": {
      "course_code": "23BS1101",
      "course_name": "Linear Algebra & Calculus",
      "semester": "1",
      "category": "Basic Science",
      "credits": 3,
      "prerequisites": "10+2 level Mathematics",
      "course_outcomes": [
        "Solve the system of homogeneous and non-homogeneous linear equations",
        "Examine the nature of a quadratic form by transforming into a canonical form",
        "Determine maxima and minima of multivariable functions",
        "Evaluate areas and volumes using double, triple integrals"
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Matrices",
        "topics": "Rank of a matrix by Echelon form, Normal form, Cauchy–Binet formulae (without proof), Inverse of Non- singular matrices by Gauss-Jordan method, System of linear equations: Solving system of Homogeneous and Non-Homogeneous equations by Gauss elimination method, Jacobi and Gauss-Seidel Iteration Methods."
      },
      {
        "unit_number": "2",
        "title": "Eigenvalues, Eigenvectors and Orthogonal Transformation",
        "topics": "Eigenvalues, Eigenvectors and their properties, Diagonalization of a matrix, Cayley-Hamilton Theorem (without proof), Finding inverse and power of a matrix by Cayley-Hamilton Theorem, Quadratic forms and Nature of the Quadratic forms, Reduction of Quadratic form to Canonical forms by Orthogonal Transformation."
      },
      {
        "unit_number": "3",
        "title": "Differential Calculus",
        "topics": "Mean Value Theorems: Rolle’s theorem, Lagrange’s mean value theorem with their geometrical interpretation, Cauchy’s mean value theorem, Taylor’s and Maclaurin’s theorems with remainders (without proof), Problems and applications on the above theorems. Functions of Several Variables: Continuity and Differentiability, Partial derivatives, Total derivatives, Chain rule, Directional derivative, Taylor’s and Maclaurin’s series expansion of functions of two variables, Jacobians, Functional dependence, Maxima and Minima of functions of two variables, Method of Lagrange multipliers."
      },
      {
        "unit_number": "4",
        "title": "Multiple Integrals (Multivariable Calculus)",
        "topics": "Double integrals,Triple integrals, Change of order of integration, Change of variables to polar, cylindrical and spherical coordinates, Finding areas (by double integrals) and volumes (by double integrals and triple integrals)."
      }
    ],
    "books": {
      "textbooks": [
        "Higher Engineering Mathematics, B. S. Grewal, Khanna Publishers, 2017, 44th Edition"
      ],
      "reference_books": [
        "Advanced Engineering Mathematics, Erwin Kreyszig, John Wiley & Sons, 2018, 10th Edition",
        "Thomas Calculus, George B. Thomas, Maurice D. Weir and Joel Hass, Pearson Publishers, 2018, 14th Edition",
        "Advanced Engineering Mathematics, R. K. Jain and S. R. K. Iyengar, Alpha Science International Ltd., 2021 5th Edition(9th reprint)",
        "Advanced Modern Engineering Mathematics, Glyn James, Pearson publishers, 2018, 5th Edition",
        "Advanced Engineering Mathematics, Micheael Greenberg, , Pearson publishers, 9th Edition",
        "Higher Engineering Mathematics, H. K Das, Er. Rajnish Verma, S. Chand Publications,2014, 3rd Edition (Reprint 2021)"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23BS1102A",
      "course_name": "Engineering Chemistry",
      "semester": "1",
      "category": "Basic Science",
      "credits": 3,
      "prerequisites": "10 + 2 level Chemistry",
      "course_outcomes": [
        "Analyse various water treatment methods and boiler troubles.",
        "Apply the knowledge of basic electrochemistry principles for electrochemical energy systems and corrosion.",
        "Compare mechanistic aspects of polymerisation, and different polymers and conventional fuels for their effective utilisation.",
        "Evaluate various modern engineering materials for their applications in engineering and other fields."
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Water Technology",
        "topics": "Domestic water treatment – sedimentation, coagulation, disinfection by chlorination – breakpoint chlorination, desalination of brackish water – electrodialysis and reverse osmosis (RO). Industrial water: Hardness of water, Estimation of hardness by EDTA Method, Boiler troubles – scales, caustic embrittlement, Industrial water treatment – Ion-exchange method."
      },
      {
        "unit_number": "2",
        "title": "Electrochemistry and Corrosion",
        "topics": "Electrodes, electrochemical cell, Nernst equation, cell potential calculations, Primary cells – zinc-air battery, Secondary cells –lithium ion batteries; Fuel cells – hydrogen-oxygen fuel cell. Corrosion: Introduction, electrochemical corrosion, factors affecting corrosion, cathodic protection, copper electroplating and electroless plating."
      },
      {
        "unit_number": "3",
        "title": "Polymer and Fuel Chemistry",
        "topics": "Polymer Chemistry: Introduction, functionality of monomers, mechanism of chain growth, step growth polymerization, thermoplastics and thermosetting plastics: Preparation, properties and applications of PVC, polystyrene, Nylon 6,6 and Bakelite. Elastomers – Buna S and Buna N. Fuel Chemistry: Fuels- classification, calorific value, analysis of coal (proximate and ultimate analysis), refining of petroleum, knocking, octane and cetane number, alternative fuels –biomass, biogas, biodiesel."
      },
      {
        "unit_number": "4",
        "title": "Modern Engineering Materials",
        "topics": "Composites: classification – particle, fibre and layered reinforced composites, properties and engineering applications. Lubricants: classification, mechanisms, properties of lubricating oils. Building materials: Portland cement, constituents, setting and hardening of cement, refractories – classification and properties. Nanomaterials: classification, properties and applications."
      }
    ],
    "books": {
      "textbooks": [
        "Engineering Chemistry, Jain and Jain, 17th Edition, DhanpatRai, 2018.",
        "Engineering Chemistry, PrasanthaRath& S. ArunaKumari, Cengage Publishers, 2023."
      ],
      "reference_books": [
        "Peter Atkins, Julio de Paula and James Keeler, Atkins’ Physical Chemistry, 10/e, Oxford University Press, 2010.",
        "H.F.W. Taylor, Cement Chemistry, 2/e, Thomas Telford Publications, 1997.",
        "Textbook of polymer Science,Fred W.BillmayerJr, 3rd Edition."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ES1103B",
      "course_name": "Basic Electrical and Electronics Engineering",
      "semester": "1",
      "category": "Engineering Science",
      "credits": 3,
      "prerequisites": "Basic Electrical and Electronics Engineering",
      "course_outcomes": [
        "Apply different techniques to solve DC circuits.",
        "Understand the magnetic circuit concepts.",
        "Analyze the steady-state response, series, parallel AC circuits, mesh & nodal analysis, and resonance.",
        "Apply network theorems for AC & DC circuits.",
        "Demonstrate the working principles of basic Electronic devices, circuits and instrumentation System .",
        "Implementation of simple Combinational and Sequential circuits using Logic gates."
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "DC & AC Circuits",
        "topics": "DC Circuits: Electrical circuit elements (R, L and C), Ohm’s Law, KCL & KVL, series, parallel, series-parallel circuits, Super Position theorem. AC Circuits: A.C. Fundamentals, relationship with phasor diagrams in R, L, and C circuits, Concept of Impedance, Active power, reactive power and apparent power, Concept of power factor. Equipment Safety Measures: Fuse and Miniature circuit breaker (MCB). Personal safety measures: Electric Shock, Earthing."
      },
      {
        "unit_number": "2",
        "title": "Machines and Measuring Instruments",
        "topics": "Machines: Construction, principle and operation of DC Motor, DC Generator, Single Phase Transformer, Three Phase Induction Motor and Alternator. Measuring Instruments: Construction and working principle of Voltage, Current, temperature sensors, multimeter. Electricity bill calculation."
      },
      {
        "unit_number": "3",
        "title": "Semiconductor Devices",
        "topics": "Characteristics of PN Junction Diode, Zener Diode. Bipolar Junction Transistor, CB, CE, CC Configurations and Characteristics, Small Signal CE Amplifier. Rectifiers and power supplies: full wave bridge rectifier, capacitor filter, zener voltage regulator. Amplifiers: Block diagram of Public Address system. Electronic Instrumentation."
      },
      {
        "unit_number": "4",
        "title": "Digital Electronics",
        "topics": "Overview of Number Systems, Logic gates including Universal Gates, BCD codes, Excess-3 code, Gray code, Hamming code. Boolean Algebra, Truth Tables. Simple combinational circuits–Half and Full Adders. Introduction to Flip flops, Registers and counters."
      }
    ],
    "books": {
      "textbooks": [
        "Basic Electrical Engineering, D. P. Kothari and I. J. Nagrath, Mc Graw Hill, 2019, Fourth Edition",
        "Principles of Power Systems, V.K. Mehtha, S.Chand Technical Publishers, 2020",
        "Basic Electrical Engineering, T. K. Nagsarkar and M. S. Sukhija, Oxford University Press, 2017",
        "Basic Electrical and Electronics Engineering, S. K. Bhatacharya, Person Publications, 2018, Second Edition.",
        "R. L. Boylestad & Louis Nashlesky, Electronic Devices & Circuit Theory, Pearson Education, 2021.",
        "P. Jain, Modern Digital Electronics, 4th Edition, Tata Mc Graw Hill, 2009."
      ],
      "reference_books": [
        "R. S. Sedha, A Textbook of Electronic Devices and Circuits, S. Chand & Co, 2010.",
        "Santiram Kal, Basic Electronics- Devices, Circuits and IT Fundamentals, Prentice Hall, India, 2002.",
        "R. T. Paynter, Introductory Electronic Devices & Circuits – Conventional Flow Version, Pearson Education, 2009."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ES1104",
      "course_name": "Introduction to Programming",
      "semester": "1",
      "category": "Engineering Science",
      "credits": 3,
      "prerequisites": "--",
      "course_outcomes": [
        "To introduce students to the fundamentals of computer programming.",
        "To provide hands-on experience with coding and debugging on control structures and arrays.",
        "To foster logical thinking and problem-solving skills on strings and ponters.",
        "To familiarize students with programming concepts such as functions, structures and files."
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Introduction to Programming and Problem Solving",
        "topics": "History of Computers, Basic organization of a computer, Introduction to Programming Languages, Basics of a Computer Program- Algorithms, flowcharts, pseudo code. Introduction to Compilation and Execution, Primitive Data Types, Variables, and Constants, Basic Input and Output, Operations, Type Conversion, and Casting. Problem solving techniques: Algorithmic approach, characteristics of algorithm, Problem solving strategies: Top-down approach, Bottom-up approach, Time and space complexities of algorithms."
      },
      {
        "unit_number": "2",
        "title": "Control Structures and Arrays",
        "topics": "Simple sequential programs Conditional Statements (if, if-else, switch), Loops (for, while, do- while) Break and Continue, Arrays indexing, memory model, programs with array of integers, two dimensional arrays"
      },
      {
        "unit_number": "3",
        "title": "Strings and pointers",
        "topics": "Introduction to Strings. Pointers, dereferencing and address operators, pointer and address arithmetic, array manipulation using pointers."
      },
      {
        "unit_number": "4",
        "title": "Functions, User Defined Data types and File Handling",
        "topics": "Introduction to Functions, Function Declaration and Definition, Function call Return Types and Arguments, modifying parameters inside functions using pointers, arrays as parameters. Scope and Lifetime of Variables, User-defined data types-Structures and Unions, Basics of File Handling"
      }
    ],
    "books": {
      "textbooks": [
        "\"The C Programming Language\", Brian W. Kernighan and Dennis M. Ritchie, Prentice- Hall, 1988.",
        "Schaum’s Outline of Programming with C, Byron S Gottfried, McGraw-Hill Education, 1996"
      ],
      "reference_books": [
        "Computing fundamentals and C Programming, Balagurusamy, E., McGraw-Hill Education, 2008.",
        "Programming in C, Rema Theraja, Oxford, 2016, 2nd edition",
        "C Programming,A Problem Solving Approach,Forouzan,Gilberg,Prasad, CENGAGE, 3rd edition."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ES1105",
      "course_name": "Engineering Graphics",
      "semester": "1",
      "category": "Engineering Science",
      "credits": 3,
      "prerequisites": "NIL",
      "course_outcomes": [
        "Understand the principles of engineering drawing, including engineering curves and scales.",
        "Draw and interpret orthographic projections of points, lines and planes in front, top and side views.",
        "Understand and draw projection of solids in various positions in first quadrant and Explain principles behind development of surfaces.",
        "Explain principles behind the Sections of solids, Prepare isometric views and conversion of simple solids."
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Introduction to Drawing, Curves, and Scales",
        "topics": "Introduction: Lines, Lettering and Dimensioning, Geometrical Constructions of regular polygons by general methods. Curves: Construction of ellipse, parabola and hyperbola by general method and Involutes. Draw normal and tangent to Curves. Scales: Plain scales and diagonal scales."
      },
      {
        "unit_number": "2",
        "title": "Orthographic Projections",
        "topics": "Reference plane, Projections of a point in first quadrant. Projections of Straight Lines parallel to both planes, perpendicular to one plane and parallel to other, inclined to one plane and parallel to the other. Projections of Straight Line Inclined to both the reference planes. Projections of Planes: Regular planes perpendicular to both reference planes, parallel to one and inclined to the other; plane inclined to both the reference planes."
      },
      {
        "unit_number": "3",
        "title": "Projections of Solids and Development of Surfaces",
        "topics": "Projections of solids(Prisms and Pyramids only) in simple positions. Development of Surfaces: Methods of Development: Parallel line development and radial line development. Development of a cube, prism, cylinder, pyramid and cone. Computer graphics: Creating 2D & 3D drawings of objects using Auto CAD (Not for end examination)."
      },
      {
        "unit_number": "4",
        "title": "Sections of Solids, Isometric Views, and Conversion of Views",
        "topics": "Sections of Solids: Section planes perpendicular to VP and inclined to HP only, Sectional views. Isometric Views: Draw an Isometric views of Simple solids. Conversion of Views: Conversion of isometric views to orthographic views of Simple solids."
      }
    ],
    "books": {
      "textbooks": [
        "N. D. Bhatt, Engineering Drawing, Charotar Publishing House, 2016."
      ],
      "reference_books": [
        "Engineering Drawing, Basant Agrawal and C M Agrawal,Tata McGraw Hill, 2009.",
        "Engineering Drawing, K.L. Narayana and P. Kannaiah, Tata McGraw Hill, 2013.",
        "Engineering Drawing, M.B.Shah and B.C. Rana, Pearson Education Inc,2009.",
        "Engineering Drawing with an Introduction to Auto CAD, Dhananjay Jolhe , Tata McGraw Hill, 2017."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23BS1151A",
      "course_name": "Engineering Chemistry Lab",
      "semester": "1",
      "category": "Basic Science",
      "credits": 1,
      "prerequisites": "Knowledge of chemistry practicals at Intermediate level",
      "course_outcomes": [
        "Analyze water samples and various commercial samples of acids, cement, coal, lubricants, etc. for their purity and quality.",
        "Analyze samples of water and cement through various instrumental methods like colorimetry, and pH metry.",
        "Apply standard procedures for preparation of nanomaterials, polymers and blueprinting, as well as study the adsorption process."
      ]
    },
    "syllabus": [
      {
        "unit_number": "Lab",
        "title": "List of Experiments",
        "topics": [
          "Determination of hardness of a groundwater sample",
          "Determination of strength of an acid in Lead-acid battery",
          "Determination of calcium in Portland cement",
          "Determination of strength of a base using pH metric titration",
          "Determination of percentage of iron in cement sample by colorimetry",
          "Chemistry of blueprinting",
          "Preparation of a polymer – Urea-formaldehyde resin",
          "Preparation of nanomaterials by precipitation method",
          "Adsorption of acetic acid by charcoal",
          "Determination of percentage moisture content in a coal sample",
          "Determination of viscosity of lubricating oil by Redwood viscometer",
          "Determination of calorific value of gases by Junker’s gas calorimeter"
        ]
      }
    ],
    "books": {
      "textbooks": [],
      "reference_books": [
        "“Vogel’s quantitative chemical analysis”, 6th Edition, by J. Mendham, R.C. Denney, J.D. Barnes and B. Sivasankar, Pearson Publications."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ES1152",
      "course_name": "Computer Programming Lab",
      "semester": "1",
      "category": "Engineering Science",
      "credits": 1.5,
      "prerequisites": "Not specified",
      "course_outcomes": [
        "Read, understand, and trace the execution of programs written in C language.",
        "Select the right control structure for solving the problem.",
        "Develop C programs which utilize memory efficiently using programming constructs like pointers.",
        "Develop, Debug and Execute programs to demonstrate the applications of arrays, functions, basic concepts of pointers in C."
      ]
    },
    "syllabus": [
      {
        "unit_number": "Lab",
        "title": "List of Experiments",
        "topics": "Familiarization with programming environment, Converting algorithms/flow charts into C Source code, Simple computational problems using arithmetic expressions, Problems involving if-then-else structures, Iterative problems, 1D Array manipulation, Matrix problems, String operations, Bubble sort, Pointers and structures, memory dereference, Bitfields, linked lists, Simple functions using call by value, Recursive functions, Call by reference, File operations."
      }
    ],
    "books": {
      "textbooks": [
        "Ajay Mittal, Programming in C: A practical approach, Pearson.",
        "Byron Gottfried, Schaum's Outline of Programming with C, McGraw Hill"
      ],
      "reference_books": [
        "Brian W. Kernighan and Dennis M. Ritchie, The C Programming Language, Prentice- Hall of India",
        "C Programming, A Problem-Solving Approach, Forouzan, Gilberg, Prasad, CENGAGE"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ES1153",
      "course_name": "Basic Electrical and Electronics Workshop",
      "semester": "1",
      "category": "Engineering Science",
      "credits": 1.5,
      "prerequisites": "Engineering Physics",
      "course_outcomes": [
        "Measure voltage, current and power in an electrical circuit",
        "Measure of Resistance using Wheat stone bridge.",
        "Discover critical field resistance and critical speed of DC shunt generators",
        "Investigate the effect of reactive power and power factor in electrical loads",
        "Identify & testing of various electronic components.",
        "Understand the usage of electronic measuring instruments.",
        "Plot and discuss the characteristics of various electron devices.",
        "Explain the operation of a digital circuit."
      ]
    },
    "syllabus": [
      {
        "unit_number": "Lab",
        "title": "List of Experiments",
        "topics": "Part A: Electrical Lab - Verification of KCL and KVL, Superposition theorem, Measurement of Resistance using Wheat stone bridge, Magnetization Characteristics of DC shunt Generator, Measurement of Power and Power factor, Measurement of Earth Resistance using Megger, Calculation of Electrical Energy. Part B: Electronics Lab - V-I characteristics of PN Junction & Zener Diode, Implementation of rectifiers, Input & Output characteristics of BJT, Frequency response of CE amplifier, Simulation of RC coupled amplifier, Verification of Truth Table of Logic gates, Verification of Truth Tables of flip flops."
      }
    ],
    "books": {
      "textbooks": [],
      "reference_books": [
        "Basic Electrical Engineering, D. C. Kulshreshtha, Tata McGraw Hill, 2019, 1st edition",
        "Power System Engineering, P.V. Gupta, M.L. Soni, U.S. Bhatnagar and A. Chakrabarti, Dhanpat Rai & Co, 2013",
        "Fundamentals of Electrical Engineering, Rajendra Prasad, PHI publishers, 2014, 3rd edition.",
        "R. L. Boylestad & Louis Nashlesky, Electronic Devices & Circuit Theory, Pearson Education, 2021.",
        "R. P. Jain, Modern Digital Electronics, 4th Edition, Tata Mc Graw Hill, 2009",
        "R. T. Paynter, Introductory Electronic Devices & Circuits – Conventional Flow Version, Pearson Education,2009."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23BS1154B",
      "course_name": "Health and wellness, Yoga and Sports",
      "semester": "1",
      "category": "Basic Science",
      "credits": 0.5,
      "prerequisites": "-",
      "course_outcomes": [
        "Understand the importance of yoga and sports for Physical fitness and sound health",
        "Demonstrate an understanding of health-related fitness components",
        "Compare and contrast various activities that help enhance their health.",
        "Assess current personal fitness levels.",
        "Develop Positive Personality"
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Health and Fitness",
        "topics": "Concept of health and fitness, Nutrition and Balanced diet, basic concept of immunity, Relationship between diet and fitness, Globalization and its impact on health, Body Mass Index (BMI)."
      },
      {
        "unit_number": "2",
        "title": "Yoga",
        "topics": "Concept of yoga, need for and importance of yoga, origin and history of yoga in Indian context, classification of yoga, Physiological effects of Asanas- Pranayama and meditation, stress management and yoga, Mental health and yoga practice."
      },
      {
        "unit_number": "3",
        "title": "Sports and Fitness",
        "topics": "Concept of Sports and fitness, importance, fitness components, history of sports, Ancient and Modern Olympics, Asian games and Commonwealth games."
      }
    ],
    "books": {
      "textbooks": [],
      "reference_books": [
        "Gordon Edlin, Eric Golanty. Health and Wellness, 14th Edn. Jones & Bartlett Learning, 2022",
        "T.K.V.Desikachar. The Heart of Yoga: Developing a Personal Practice",
        "Archie J.Bahm. Yoga Sutras of Patanjali, Jain Publishing Company, 1993",
        "Wiseman, John Lofty, SAS Survival Handbook: The Ultimate Guide to Surviving Anywhere Third Edition, William Morrow Paperbacks, 2014",
        "The Sports Rules Book/ Human Kinetics with Thomas Hanlon. -- 3rd ed. Human Kinetics, Inc.2014"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23MC1106",
      "course_name": "Induction Program",
      "semester": "1",
      "category": "Mandatory Course",
      "credits": 0,
      "prerequisites": "Not specified",
      "course_outcomes": []
    },
    "syllabus": [
      {
        "unit_number": "N/A",
        "title": "Syllabus Not Available",
        "topics": "A detailed syllabus for this course is not provided in the supplied document."
      }
    ],
    "books": {
      "textbooks": [],
      "reference_books": []
    }
  },
  {
    "metadata": {
      "course_code": "23BS2101",
      "course_name": "Differential Equations & Vector Calculus",
      "semester": "2",
      "category": "Basic Science",
      "credits": 3,
      "prerequisites": "23BS1101 LinearAlgebra & Calculus",
      "course_outcomes": [
        "Solve first order linear differential equations",
        "Solve higher order linear differential equations with constant coefficients",
        "Solve Partial differential equations",
        "Evaluate the work done against field, circulation and flux using vector calculus"
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Differential equations of first order and first degree",
        "topics": "Linear differential equations – Bernoulli’s equations- Exact equations and equations reducible to exact form, Applications: Newton’s Law of cooling – Law of natural growth and decay- Electrical circuits."
      },
      {
        "unit_number": "2",
        "title": "Linear differential equations of higher order (Constant Coefficients)",
        "topics": "Definitions,homogenous and non-homogenous, complimentary function, general solution, particular integral, Wronskian, Method of variation of parameters, Simultaneous linear equations, Applications to L-CR Circuit problems and Simple Harmonic motion."
      },
      {
        "unit_number": "3",
        "title": "Partial Differential Equations",
        "topics": "Introduction and formation of Partial Differential Equations by elimination of arbitrary constants and arbitrary functions, solutions of first order linear equations using Lagrange’s method, Homogeneous Linear Partial differential equations with constant coefficients."
      },
      {
        "unit_number": "4",
        "title": "Vector Calculus",
        "topics": "Scalar and vector point functions, vector operator Del, Del applies to scalar point functions- Gradient, Directional derivative, del applied to vector point functions-Divergence and Curl, vector identities. Line integral-circulation-work done, surface integral-flux, Green’s theorem in the plane (without proof), Stoke’s theorem (without proof), volume integral, Divergence theorem (without proof) and related problems."
      }
    ],
    "books": {
      "textbooks": [
        "Higher Engineering Mathematics, B. S. Grewal, Khanna Publishers, 2017, 44th Edition"
      ],
      "reference_books": [
        "Advanced Engineering Mathematics, Erwin Kreyszig, John Wiley & Sons, 2018, 10th Edition.",
        "Thomas Calculus, George B. Thomas, Maurice D. Weir and Joel Hass, Pearson Publishers, 2018, 14th Edition.",
        "Advanced Engineering Mathematics, R. K. Jain and S. R. K. Iyengar, Alpha Science International Ltd., 2021 5th Edition(9th reprint).",
        "Advanced Modern Engineering Mathematics, Glyn James, Pearson publishers, 2018, 5th Edition.",
        "Advanced Engineering Mathematics, Micheael Greenberg, Pearson publishers, 9th Edition.",
        "Higher Engineering Mathematics, H. K Das, Er. Rajnish Verma, S. Chand Publications,2014, 3rd Edition (Reprint 2021)."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23BS2102",
      "course_name": "Engineering Physics",
      "semester": "2",
      "category": "Basic Science",
      "credits": 3,
      "prerequisites": "Not specified",
      "course_outcomes": [
        "Elaborate different types of lasers, optical fibers and their applications.",
        "Familiarize with the basics of crystals and their structures.",
        "Summarize various types of polarization of dielectrics and classify the magnetic materials.",
        "Explain the basic concepts of Quantum Mechanics and types of semiconductors using Hall Effect."
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Lasers and Fiber Optics",
        "topics": "Lasers: Introduction, Characteristics, Basic Principles, Requirements, Einstein’s coefficients, types of lasers (solid-state, gas, semiconductor), applications. Fibre Optics: Introduction, Fundamentals, Propagation of light, Types, Numerical aperture, Fiber optics in communication."
      },
      {
        "unit_number": "2",
        "title": "Crystallography and X-ray diffraction",
        "topics": "Crystallography: Space lattice, Basis, Unit Cell, lattice parameters, Bravais Lattices, crystal systems, coordination number, packing fraction (SC, BCC, FCC), Miller indices. X-ray diffraction: Bragg’s law, X-ray Diffractometer, crystal structure determination."
      },
      {
        "unit_number": "3",
        "title": "Dielectric and Magnetic Materials",
        "topics": "Dielectric Materials: Introduction, Dielectric polarization, polarizability, Susceptibility, Dielectric constant, Types of polarizations, Lorentz internal field, Clausius- Mossotti equation. Magnetic Materials: Introduction, Magnetic dipole moment, Magnetization, susceptibility, permeability, Classification of magnetic materials, Domain concept, Hysteresis."
      },
      {
        "unit_number": "4",
        "title": "Quantum Mechanics and Semiconductors",
        "topics": "Quantum Mechanics: Dual nature of light, Matter waves, Debroglie’s hypothesis, Heisenberg’s Uncertainty Principle, Schrodinger’s wave equations, Particle in a one-dimensional infinite potential well. Semiconductors: Formation of energy bands, Intrinsic and Extrinsic semiconductors, Fermi level, Drift and diffusion currents, Einstein’s equation, Hall effect, Photodiode, LED, Solar cell."
      }
    ],
    "books": {
      "textbooks": [
        "A Text book of Engineering Physics, M. N. Avadhanulu, P.G.Kshirsagar & TVS Arun Murthy, S. Chand Publications, 11th Edition 2019.",
        "Engineering Physics - D.K.Bhattacharya and Poonam Tandon, Oxford press (2015)"
      ],
      "reference_books": [
        "Engineering Physics - B.K. Pandey and S. Chaturvedi, Cengage Learning 2021.",
        "Engineering Physics - Shatendra Sharma, Jyotsna Sharma, Pearson Education, 2018.",
        "Engineering Physics - Sanjay D. Jain, D. Sahasrabudhe and Girish, University Press. 2010",
        "Engineering Physics - M.R. Srinivasan, New Age international publishers (2009)."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ES2103A",
      "course_name": "Basic Civil and Mechanical Engineering",
      "semester": "2",
      "category": "Engineering Science",
      "credits": 3,
      "prerequisites": "10 + 2",
      "course_outcomes": [
        "Understand various Civil Engineering sub-divisions thereby appreciate their role in ensuring a better society and understand the basic building components along with attaining knowledge of Civil Engineering Materials and prefabricated technology.",
        "Know the basic concepts, uses and classification of surveying and realize the importance of Transportation in the nation's economy and the engineering measures related to Transportation and understand the importance of Water Storage and Conveyance Structures so that the social responsibilities of water conservation will be appreciated",
        "Understand the scope of Mechanical Engineering in different sectors and industries and know about different manufacturing processes.",
        "Explain the basics of thermal engineering, Power plants , power transmission and robotics."
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Basics of Civil Engineering",
        "topics": "Role of Civil Engineers in Society- Various Disciplines of Civil Engineering - Building Construction and Planning - Construction Materials-Cement - Aggregate - Bricks- Cement concrete- Steel-Introduction to Prefabricated Construction Techniques"
      },
      {
        "unit_number": "2",
        "title": "Surveying, Transportation, Water Resources and Environmental Engineering",
        "topics": "Surveying and Transportation Engineering: Objectives and Principles of Surveying, Classification, Importance of Transportation, Basics components of Road-Classification of Highways. Water Resources and Environmental Engineering: Introduction, Sources of water- Quality of water- Specifications- Simple introduction to Dams and Reservoirs."
      },
      {
        "unit_number": "3",
        "title": "Introduction to Mechanical Engineering",
        "topics": "Role of Mechanical Engineering in Industries and Society - Engineering Materials - Metals-Ferrous and Non-ferrous, Ceramics, Composites, Smart materials. Manufacturing Processes: Principles of Casting, joining processes, Machining, Introduction to CNC machines, 3D printing, and Smart manufacturing."
      },
      {
        "unit_number": "4",
        "title": "Thermal Engineering and Mechanical Power Transmission",
        "topics": "Thermal Engineering: IC engines, 2-Stroke and 4-Stroke engines, SI/CI Engines, Otto cycle,Diesel cycle,Components of Electric and Hybrid Vehicles., Refrigeration and air conditioning Working principle of Boilers: classification of Boilers Power plants – Working principle of Steam, Nuclear power plants. Mechanical Power Transmission - Belt and Gear Drives, Introduction to Robotics"
      }
    ],
    "books": {
      "textbooks": [
        "Basic Civil Engineering, M.S.Palanisamy, , Tata Mcgraw Hill publications (India) Pvt. Ltd. Fourth Edition.",
        "Introduction to Civil Engineering, S.S. Bhavikatti, New Age International Publishers. 2022. First Edition.",
        "Basic Civil Engineering, Satheesh Gopi, Pearson Publications, 2009, First Edition.",
        "Internal Combustion Engines by V.Ganesan, By Tata McGraw Hill publications (India) Pvt. Ltd.",
        "A text book of Theory of Machines by S.S. Rattan, Tata McGraw Hill Publications, (India) Pvt. Ltd.",
        "An introduction to Mechanical Engg by Jonathan Wicker and Kemper Lewis, Cengage learning India Pvt. Ltd."
      ],
      "reference_books": [
        "Surveying, Vol- I and Vol-II, S.K. Duggal, Tata McGraw Hill Publishers 2019. Fifth Edition.",
        "Hydrology and Water Resources Engineering, Santosh Kumar Garg, Khanna Publishers, Delhi. 2016",
        "Irrigation Engineering and Hydraulic Structures - Santosh Kumar Garg, Khanna Publishers, Delhi 2023. 38th Edition.",
        "Highway Engineering, S.K.Khanna, C.E.G. Justo and Veeraraghavan, Nemchand and Brothers Publications 2019. 10th Edition.",
        "Indian Standard DRINKING WATER — SPECIFICATION IS 10500-2012",
        "Advances in Civil Engineering (Volume - 5), S. Sathish, AkiNik Publications,2021",
        "G. Shanmugam and M.S.Palanisamy, Basic Civil and the Mechanical Engineering, Tata McGraw Hill publications (India) Pvt. Ltd.",
        "Thermal Engineering by Mahesh M Rathore Tata McGraw Hill publications (India) Pvt. Ltd.",
        "3D printing & Additive Manufacturing Technology- L. Jyothish Kumar, Pulak M Pandey, Springer publications",
        "Appuu Kuttan KK, Robotics, I.K. International Publishing House Pvt. Ltd. Volume-I"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23PC2104B",
      "course_name": "Engineering Mechanics",
      "semester": "2",
      "category": "Professional Core",
      "credits": 3,
      "prerequisites": "Basic Mathematics, Physics at (10 + 2) level",
      "course_outcomes": [
        "Analyze coplanar concurrent , parallel forces and evaluate centroid for plane figures",
        "Analyze coplanar general case forces and evaluate moment of inertia for plane figures",
        "Analyze rectilinear and curvilinear motion of particles",
        "Evaluate the moment of inertia of material bodies and analyze the fixed axis rotation of rigid bodies."
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Equilibrium of Concurrent and Parallel Forces",
        "topics": "Composition and resolution of forces, Free body diagram, Equilibrium of concurrent forces in a plane. Types of parallel forces, Resultant, Couple, Resolution of Force into force and a couple. Centroids of standard and composite figures."
      },
      {
        "unit_number": "2",
        "title": "Friction and General Force Systems",
        "topics": "Introduction, limiting friction, Coulomb’s laws of dry friction, coefficient of friction, Cone of static friction. Equilibrium of forces in plane-Analysis of plane trusses: Method of joints. Area Moments of Inertia: Definition, Polar Moment of Inertia, Transfer Theorem, Moments of Inertia of Composite Figures."
      },
      {
        "unit_number": "3",
        "title": "Kinematics and Kinetics of Rectilinear and Curvilinear Motion",
        "topics": "Kinematics of Rectilinear motion: Displacement, Velocity and acceleration, Motion of Uniform and Variable acceleration. Kinetics of Rectilinear motion: D’Alembert’s Principle. Kinematics of Curvilinear motion: Rectangular components of velocity and acceleration, Normal and tangential acceleration, Motion of projectiles. Kinetics of Curvilinear motion: D’Alembert’s Principle."
      },
      {
        "unit_number": "4",
        "title": "Mass Moment of Inertia and Rigid Body Motion",
        "topics": "Mass Moment of Inertia: Moment of Inertia of Masses, Transfer Formula, Mass moment of inertia of slender rod, Circular disc, Cone, Solid cylinder & Sphere. Rigid body Motion: Kinematics of rotation, Kinetics of a rigid body in rotation of about a fixed axis. Kinematics of Rigid body: Plane motion: Method of Instantaneous center of rotation."
      }
    ],
    "books": {
      "textbooks": [
        "Engineering Mechanics by S. Timoshenko & D. H. Young, 4th Edition, 2007, McGraw Hill International Edition.",
        "Engineering Mechanics Statics and dynamics by A. K. Tayal, 13th Edition, 2006, Umesh Publication, Delhi",
        "A Textbook of Engineering Mechanics, S.S Bhavikatti. New age international publications 2018"
      ],
      "reference_books": [
        "Engineering Mechanics, P.C.Dumir- S.Sengupta and Srinivas V Veeravalli , University press. 2020. First Edition.",
        "Engineering Mechanics, Statics and Dynamics, I.H. Shames., PHI, 2002. 4th Edition.",
        "Engineering Mechanics, Volume-I: Statics, Volume-II: Dynamics, J. L. Meriam and L. G. Kraige., John Wiley, 2008. 6th Edition"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23HS2105",
      "course_name": "Communicative English",
      "semester": "2",
      "category": "Basic Science",
      "credits": 2,
      "prerequisites": "Basic understanding of the language skills viz Listening, Speaking, Reading and Writing, including Sentence construction abilities",
      "course_outcomes": [
        "Understand the context, topic, and pieces of specific information from social or Transactional dialogues",
        "Apply grammatical structures to formulate sentences and correct word forms.",
        "Analyze discourse markers to speak clearly on a specific topic in informal discussions.",
        "Evaluate reading texts / listening to write summaries based on global comprehension and create a coherent paragraph, essay and résumé"
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Human Values",
        "topics": "Lesson: HUMAN VALUES: Gift of Magi (Short Story). Listening, Speaking, Reading, Writing, Grammar, and Vocabulary skills."
      },
      {
        "unit_number": "2",
        "title": "Nature",
        "topics": "Lesson: NATURE: The Brook by Alfred Tennyson (Poem). Listening, Speaking, Reading, Writing, Grammar, and Vocabulary skills."
      },
      {
        "unit_number": "3",
        "title": "Biography",
        "topics": "Lesson: BIOGRAPHY: Elon Musk. Listening, Speaking, Reading, Writing, Grammar, and Vocabulary skills."
      },
      {
        "unit_number": "4",
        "title": "Inspiration",
        "topics": "Lesson: INSPIRATION: The Toys of Peace by Saki. Listening, Speaking, Reading, Writing, Grammar, and Vocabulary skills."
      }
    ],
    "books": {
      "textbooks": [
        "Pathfinder: Communicative English for Undergraduate Students, 1st Edition, Orient Black Swan, 2023",
        "Empowering with Language by Cengage Publications, 2023",
        "English: Language, Context and Culture, 1st Edition, Orient Black Swan, 2023"
      ],
      "reference_books": [
        "Dubey, Sham Ji & Co. English for Engineers, Vikas Publishers, 2020",
        "Bailey, Stephen. Academic writing: A Handbook for International Students. Routledge, 2014.",
        "Murphy, Raymond. English Grammar in Use, Fourth Edition, Cambridge University Press, 2019.",
        "Lewis, Norman. Word Power Made Easy- The Complete Handbook for Building a Superior Vocabulary. Anchor, 2014."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23BS2151",
      "course_name": "Engineering Physics Lab",
      "semester": "2",
      "category": "Basic Science",
      "credits": 1,
      "prerequisites": "Not specified",
      "course_outcomes": [
        "Test optical components using principles of interference and diffraction of light",
        "Use spectrometer, travelling microscope and function generator in various experiments",
        "Determine the V-I characteristics of photo cells and appreciate the accuracy in measurements"
      ]
    },
    "syllabus": [
      {
        "unit_number": "Lab",
        "title": "List of Experiments",
        "topics": [
          "Determination of radius of curvature of a given Plano-convex lens by Newton’s rings.",
          "Study the variation of B versus H by magnetizing the magnetic material (B-H curve).",
          "Determination of wavelength of Laser light using diffraction grating.",
          "Estimation of stopping potential and work function of a photo material using photoelectric effect.",
          "Magnetic field along the axis of a current carrying circular coil by Stewart Gee’s Method.",
          "Determination of Hall voltage and Hall coefficient of a given semiconductor using Hall Effect.",
          "Determination of Acceleration due to Gravity and radius of Gyration by using a compound pendulum.",
          "Sonometer: Verification of laws of stretched string.",
          "Determination of Dielectric constant of different solid materials.",
          "Determination of Numerical Aperture of a given optical fiber.",
          "Determination of Frequency of electrically maintained tuning fork by Melde’s experiment.",
          "Determination of Rigidity Modulus of the material of the given wire using Torsional pendulum."
        ]
      }
    ],
    "books": {
      "textbooks": [
        "Madhusudhan Rao, “Engineering Physics Lab Manual”, Ist ed., Scitech Publications, 2015",
        "Ramarao Sri, Choudary Nityanand and Prasad Daruka, ”Lab Manual of Engineering Physics”., Vth ed., Excell Books, 2010"
      ],
      "reference_books": []
    }
  },
  {
    "metadata": {
      "course_code": "23PC2152E",
      "course_name": "Engineering Mechanics Lab (ME)",
      "semester": "2",
      "category": "Professional Core",
      "credits": 1.5,
      "prerequisites": "10 + 2 level Physics",
      "course_outcomes": [
        "Evaluate the coefficient of friction between two different surfaces and between the inclined plane and the roller.",
        "Verify Law of Polygon of forces and Law of Moment using force polygon and bell crank lever.",
        "Determine the Centre of gravity and Moment of Inertia of different configurations.",
        "Verify the equilibrium conditions of a rigid body under the action of different force systems."
      ]
    },
    "syllabus": [
      {
        "unit_number": "Lab",
        "title": "List of Experiments",
        "topics": [
          "Verification of Law of Parallelogram of Forces.",
          "Verification of Law of Triangle of Forces.",
          "Verification of the Law of polygon for coplanar-concurrent forces.",
          "Determination of coefficient of Static and Rolling Frictions",
          "Determination of Centre of Gravity of different shaped Plane Lamina.",
          "Verification of the conditions of equilibrium of a rigid body.",
          "Study of the systems of pulleys and draw the free body diagram.",
          "Determine the acceleration due to gravity using a compound pendulum.",
          "Determine the Moment of Inertia of the compound pendulum.",
          "Determine the Moment of Inertia of a Flywheel.",
          "Verification of Law of Moment using Rotation Disc Apparatus and Bell Crank Lever."
        ]
      }
    ],
    "books": {
      "textbooks": [],
      "reference_books": [
        "S. Timoshenko, D. H. Young, J.V. Rao, S. Pati., Engineering Mechanics, 5th Edition, McGraw Hill Education.",
        "Hibbeler R.C., Engineering Mechanics: Statics and Dynamics, 14th Edition, Pearson Education, Inc., New Delhi, 2022"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23HS2153",
      "course_name": "Communicative English Lab",
      "semester": "2",
      "category": "Basic Science",
      "credits": 1,
      "prerequisites": "Basic understanding of the language skills",
      "course_outcomes": [
        "Understand the different aspects of the English language proficiency with emphasis on LSRW skills.",
        "Apply communication skills through various language learning activities.",
        "Analyze the English speech sounds, stress, rhythm, intonation and syllable division for better listening and speaking comprehension.",
        "Evaluate and exhibit professionalism in participating in debates and group discussions."
      ]
    },
    "syllabus": [
      {
        "unit_number": "Lab",
        "title": "List of Topics",
        "topics": [
          "Vowels and Consonants",
          "Neutralizaton/Accent Rules",
          "Communication Skills & JAM",
          "Role Play or Conversational Practice",
          "E-mail Writing",
          "Resume Writing, Cover Letter, SOP",
          "Group Discussions-methods & practice",
          "Debates – Methods & Practice",
          "PPT Presentations/Poster Presentations",
          "Interview Skills"
        ]
      }
    ],
    "books": {
      "textbooks": [],
      "reference_books": []
    }
  },
  {
    "metadata": {
      "course_code": "23ES2154",
      "course_name": "Engineering Workshop",
      "semester": "2",
      "category": "Engineering Science",
      "credits": 1.5,
      "prerequisites": "Not specified",
      "course_outcomes": [
        "Understand the basic joints using wood and familiarize with various fundamental aspects of house wiring, fitting and foundry.",
        "Prepare basic models using sheet metal and practice joining of metals using various types of welding.",
        "Familiarize with various advanced manufacturing processes such as injection moulding and 3D printing.",
        "Understand the preparation of PCB and simple IOT applications using Arduino"
      ]
    },
    "syllabus": [
      {
        "unit_number": "Lab",
        "title": "List of Trades",
        "topics": "Demonstration: Safety practices. Wood Working: Half–Lap joint, Bridle joint. Sheet Metal Working: Tapered tray, Conical funnel. Fitting: V-fit, Semi-circular fit, Bicycle tire puncture. Electrical Wiring: Parallel and series, Two-way switch, Godown lighting, Tube light. Foundry Trade: Preparation of Green Sandmoulds. Welding Shop: Arc Welding and Gas welding. Advanced manufacturing processes: injection moulding and 3D printing. Electronic Circuits: preparation of simple electronic circuit (PCB). Basic IOT: Measure Temperature & Humidity, Measure Distance."
      }
    ],
    "books": {
      "textbooks": [
        "Basic Workshop Technology: Manufacturing Process, Felix W.; Independently Published,2019.",
        "Workshop Processes, Practices and Materials; Bruce J. Black, Routledge publishers, 5th Edn. 2015.",
        "A Course in Workshop Technology Vol I. & II, B.S. Raghuwanshi, DhanpathRai& Co., 2015 & 2017."
      ],
      "reference_books": [
        "Elements of Workshop Technology, Vol. I by S. K. Hajra Choudhury & Others, Media Promoters and Publishers, Mumbai. 2007, 14th edition.",
        "Workshop Practice by H. S. Bawa, Tata-McGraw Hill, 2004.",
        "Wiring Estimating, Costing and Contracting; Soni P.M. &Upadhyay P.A.; AtulPrakashan, 2021-22."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ES2155",
      "course_name": "IT Work shop",
      "semester": "2",
      "category": "Engineering Science",
      "credits": 1,
      "prerequisites": "Not specified",
      "course_outcomes": [
        "Perform Hardware troubleshooting.",
        "Understand Hardware components and inter dependencies.",
        "Safeguard computer systems from viruses/worms.",
        "Document/ Presentation preparation.",
        "Perform calculations using spreadsheets."
      ]
    },
    "syllabus": [
      {
        "unit_number": "Lab",
        "title": "List of Tasks",
        "topics": "PC Hardware & Software Installation: Identify peripherals, Disassemble and assemble PC, Install MS windows, Linux, and BOSS. Internet & World Wide Web: Configure TCP/IP, Web Browsers, Surfing, Search Engines, Cyber Hygiene. LaTeX and WORD: Word Orientation, Create project certificate, project abstract, Newsletter. EXCEL: Excel Orientation, Creating a Scheduler, Calculating GPA, LOOKUP/VLOOKUP. POWER POINT: Basic utilities, Interactive presentations, Master Layouts. AI TOOLS – ChatGPT: Prompt Engineering, Creative Writing, Language Translation."
      }
    ],
    "books": {
      "textbooks": [],
      "reference_books": [
        "Comdex Information Technology course tool kit, Vikas Gupta, WILEY Dream tech, 2003",
        "The Complete Computer upgrade and repair book, Cheryl A Schmidt, WILEY Dream tech,2013, 3rd edition",
        "Introduction to Information Technology, ITL Education Solutions limited, Pearson Education, 2012, 2nd edition"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23BS2156",
      "course_name": "NSS/NCC/Community Service",
      "semester": "2",
      "category": "Basic Science",
      "credits": 0.5,
      "prerequisites": "Not specified",
      "course_outcomes": [
        "Understand the importance of discipline, character and service motto.",
        "Solve some societal issues by applying acquired knowledge, facts, and techniques.",
        "Explore human relationships by analyzing social problems.",
        "Determine to extend their help for the fellow beings and downtrodden people.",
        "Develop leadership skills and civic responsibilities."
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Orientation",
        "topics": "General Orientation on NSS/NCC/ Scouts & Guides/Community Service activities, career guidance."
      },
      {
        "unit_number": "2",
        "title": "Nature & Care Activities",
        "topics": "Best out of waste competition, Poster and signs making competition, Recycling and environmental pollution article writing competition, Organising Zero-waste day, Digital Environmental awareness activity, Virtual demonstration of eco-friendly approaches, Write a summary on any book related to environmental issues."
      },
      {
        "unit_number": "3",
        "title": "Community Service Activities",
        "topics": "Conducting One Day Special Camp in a village, awareness programs on Health-related issues, consumer Awareness, Women Empowerment Programmes."
      }
    ],
    "books": {
      "textbooks": [],
      "reference_books": [
        "Nirmalya Kumar Sinha & Surajit Majumder, A Text Book of National Service Scheme Vol;.I, Vidya Kutir Publication, 2021 ( ISBN 978-81-952368-8-6)",
        "Red Book - National Cadet Corps – Standing Instructions Vol I & II, Directorate General of NCC, Ministry of Defence, New Delhi",
        "Davis M. L. and Cornwell D. A., “Introduction to Environmental Engineering”, McGraw Hill, New York 4/e 2008",
        "Masters G. M., Joseph K. and Nagendran R. “Introduction to Environmental Engineering and Science”, Pearson Education, New Delhi. 2/e 2007",
        "Ram Ahuja. Social Problems in India, Rawat Publications, New Delhi."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23BS3101E",
      "course_name": "Mathematics for Mechanical Engineers",
      "semester": "3",
      "category": "Basic Sciences & Humanities",
      "credits": 3,
      "prerequisites": "23BS1101-Linear Algebra and Calculus, 23BS2101-Differential equations & Vector Calculus",
      "course_outcomes": [
        "Determine analytic, non-analytic functions and evaluate complex integrals",
        "Analyze Taylor, Laurent series and apply residue theorem for computing real definite integrals.",
        "Solve Algebraic and transcendental,system of equations and interpret the concept of polynomial interpolation",
        "Find the probabilities using distributions and to estimate correlation, regression coefficients"
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Complex Analysis",
        "topics": "Introduction, Continuity, Cauchy-Riemann equations, Analytic functions, Harmonic functions, Orthogonal systems, Applications to flow problems, Complex integration, Cauchy's integral theorem, Cauchy's integral formula"
      },
      {
        "unit_number": "2",
        "title": "Series and Residues",
        "topics": "Taylor's series, Laurent's series, Zeros and Singularities of an analytic function, Residue theorem, Calculation of Residues, Evaluation of real definite integrals: (i) Integration around the unit circle (ii) Integration around a small semi-circle, Bilinear transformation."
      },
      {
        "unit_number": "3",
        "title": "Numerical Methods",
        "topics": "Solution of Algebraic and Transcendental equations with Newton - Raphson method, Solution of Simultaneous linear equations with Gauss - Seidel iterative method. INTERPOLATION: Introduction, Finite Differences-Forward, Backward and Central differences, Symbolic Relations, Newton’s interpolation formulae-forward and backward differences, Central difference interpolation formulae-Gauss’s formulae, Interpolation with unequal intervals - Lagrange’s and Newton’s divided difference formulae."
      },
      {
        "unit_number": "4",
        "title": "Probability and Statistics",
        "topics": "PROBABILITY DENSITIES: Continuous random variables – Normal distribution. SAMPLING DISTRIBUTIONS: Populations and Samples – Sampling distribution of the mean (SD known) – Sampling distribution of the mean (SD unknown) – Sampling distribution of the variance. STATISTICS: Method of Least Squares – Correlation – Regression."
      }
    ],
    "books": {
      "textbooks": [
        "B. S. Grewal, “Higher Engineering Mathematics”, 44th Edition, Khanna   Publishers, 2019.",
        "Richard A. Johnson, “Probability and Statistics for Engineers”, 8th Edition, Prentice Hall of India, 2011."
      ],
      "reference_books": [
        "Erwin Kreyzig, “Advanced Engineering Mathematics”, 10th Edition, John Wiley  & Sons, 2015.",
        "R. K. Jain, S. R. K. Iyengar, “Advanced Engineering Mathematics”, 5th   Edition, Narosa Publishers, 2016.",
        "N. P. Bali, Manish Goyal, “A Text book of Engineering Mathematics”, 9th Edition,    Lakshmi Publications   (P) Limited, 2016.",
        "H. K. Das, Er. Rajnish Verma, “Higher Engineering Mathematics”, 3rd Revised Edition,  S. Chand & Co., 2014.",
        "Rukmangadachari E, “Probability and Statistics”, Pearson, 2012"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23HS3102",
      "course_name": "Universal Human Values 2 – Understanding Harmony",
      "semester": "3",
      "category": "Basic Sciences & Humanities",
      "credits": 3,
      "prerequisites": "Not specified",
      "course_outcomes": [
        "Understand and aware of themselves and their surroundings (family, society and nature).",
        "Handle problems with sustainable solutions, while keeping human relationships and human nature in mind.",
        "Exhibit critical ability and become sensitive to their commitment towards their understanding of human values, human relationship and human society.",
        "Apply what they have learnt to their own self in different day-to-day settings in real life."
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Course Introduction and Basic Human Aspirations",
        "topics": "Purpose and motivation for the course, recapitulation from UHV-I, Self-exploration, ‘Natural acceptance’ and experiential validation. Continuous Happiness and Prosperity. Right understanding, Relationship and Physical Facility."
      },
      {
        "unit_number": "2",
        "title": "Understanding Harmony in the Human Being – Harmony in Myself",
        "topics": "Understanding human being as a co-existence of the sentient ‘I’ and the material ‘Body’. Understanding the needs of Self (‘I’) and ‘Body’. Understanding the harmony of I with the Body: Sanyam and Health; correct appraisal of Physical needs, meaning of Prosperity in detail."
      },
      {
        "unit_number": "3",
        "title": "Understanding Harmony in the Family and Society – Harmony in Human-Human Relationship",
        "topics": "Understanding values in human-human relationship; meaning of Justice (nine universal values in relationships). Trust and Respect as the foundational values. Understanding the harmony in the society. Resolution, Prosperity, fearlessness (trust) and co-existence as comprehensive Human Goals."
      },
      {
        "unit_number": "4",
        "title": "Implications of the above Holistic Understanding of Harmony on Professional Ethics",
        "topics": "Natural acceptance of human values, Definitiveness of ethical human conduct, Basis for humanistic education, humanistic constitution and humanistic universal order, Competence in professional ethics, Case studies of typical holistic technologies, management models and production systems, Strategy for transition from the present state to Universal Human Order."
      }
    ],
    "books": {
      "textbooks": [
        "Human values and professional ethics, R. R. Gaur, R. Sangal and G. P. Bagaria, Excel Books Private Limited, New Delhi (2010)."
      ],
      "reference_books": [
        "Jeevan Vidya: Ek Parichaya, A. Nagaraj, Jeevan Vidya Prakashan, Amarkantak (1999).",
        "Human Values, A. N. Tripathi, New Age International Publishers, New Delhi (2004).",
        "The Story of Stuff, Annie Leonard, Free Press, New York (2010).",
        "The story of my experiments with truth: Mahatma Gandhi Autobiography, Mohandas Karamchand Gandhi, B. N. Publishing (2008).",
        "Small is beautiful: A study of economics as if people mattered, E. F. Schumacher, Vintage Books, London (1993)."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ES3103G",
      "course_name": "Basic Thermodynamics",
      "semester": "3",
      "category": "Engineering Science",
      "credits": 3,
      "prerequisites": "23BS2102 Engineering Physics",
      "course_outcomes": [
        "Illustrate the basic concepts of thermodynamics and can distinguish work and heat forms of energy",
        "Apply first of law of thermodynamics to flow and non-flow processes and thermodynamic systems",
        "Apply the second law of thermodynamics to systems and understand the concept of entropy, exergy and irreversibility",
        "Evaluate the properties of steam, gas mixtures and analyse steam and air cycles"
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Fundamental Concepts and Definitions",
        "topics": "Thermodynamic system, type of systems, Macroscopic and microscopic points of view, properties and state of a substance, Thermodynamic equilibrium and Quasistatic Process, thermodynamic path, cycle, Zerothlaw of thermodynamics, Temperatures scales. WORK AND HEAT: Ideal gas equation, equation of state, Work transfer, pdV-work and heat transfer in various Quasistatic processes, flow work, path function and point function, heat transfer-A path function, comparison of heat and work."
      },
      {
        "unit_number": "2",
        "title": "First Law of Thermodynamics",
        "topics": "FIRST LAW FOR NON-FLOW SYSTEMS: Joule Experiment, First law of thermodynamics for a system undergoing a cycle and for a change in state, Energy –a property of a system, internal energy and enthalpy, constant volume and constant pressure specific heats. FIRST LAW FOR FLOW SYSTEMS: Control mass and control volume, first law for a control volume, steady flow energy equation and application to engineering equipment."
      },
      {
        "unit_number": "3",
        "title": "Second Law of Thermodynamics and Entropy",
        "topics": "Cyclic heat engines and Refrigerators, Kevin Planks and Clausius statements, Equivalence, Carnot cycle, Carnot theorem, absolute thermodynamic temperature scale, efficiency of reversible heat engine, Causes of irreversibility, Concept of Exergy and irreversibility. ENTROPY: Clausius Theorem, property of entropy, Inequality of Clausius, Entropy change in irreversible process, Entropy principle, T-ds relations."
      },
      {
        "unit_number": "4",
        "title": "Gas Mixtures, Pure Substances, and Power Cycles",
        "topics": "PROPERTIES OF GAS MIXTURES: Dalton`s law of Partial Pressures, Internal Energy, enthalpy and specific heats of gas mixtures and Entropy of gas mixtures. PURE SUBSTANCES: P-v, P-T, T-s and h-s diagrams, Triple point, Critical point, Dryness fraction, Steam tables, Mollier chart. VAPOUR AND AIR POWER CYCLES: Ideal Rankine cycle, Otto cycle, Diesel cycle, Dual cycle."
      }
    ],
    "books": {
      "textbooks": [
        "P. K. Nag, “Engineering Thermodynamics” 6thedition, Tata Mc Graw Hill Education Private Limited, 2017.",
        "Mahesh M. Rathore, Thermal Engineering, Tata McGraw-Hill Education, 2010",
        "G.J.Van Wylen & Sonntag, “Fundamentals of Classical Thermodynamics”, 4th Edition, Wiley publication 2005"
      ],
      "reference_books": [
        "Yunus A. Cengel M. and Michael A. Boles, “Thermodynamics – An Engineering Approach”, 8th edition, McGrawHill Education (India) Private Limited, 2014.",
        "R.K. Rajput, Thermal Engineering, Lakshmi Publications Limited, 2020"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ME3304",
      "course_name": "Mechanics of Materials",
      "semester": "3",
      "category": "Professional Core",
      "credits": 3,
      "prerequisites": "23PC2104B Engineering Mechanics",
      "course_outcomes": [
        "Estimate the stresses and strains in structural members subjected to axial loading and analyse the members subjected to torsion.",
        "Construct Shear force and Bending moment diagrams for determinate beams and analyse the members subjected to bending.",
        "Evaluate the deflections of determinate beams and safe load on columns.",
        "Solve plane stress problems and calculate the stresses in thin cylindrical and spherical vessels."
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Tension, Compression, Shear, and Torsion",
        "topics": "TENSION, COMPRESSION AND SHEAR: Introduction, Concepts of Normal Stress and Strain, Stress-Strain Diagrams, Elasticity and Plasticity, Linear Elasticity and Hooke’s Law, Poisson’s Ratio, Shear Stress and Strain, Allowable Stresses and Allowable Loads. Numerical problems on Change in length of axially loaded members, Change in length for a tapered bar under axial loading. TORSION: Introduction, Torsional deformations of Circular Bar, Circular bars of linearly elastic materials, Transmission of power by circular shafts."
      },
      {
        "unit_number": "2",
        "title": "Statically Determinate Beams and Bending Stresses",
        "topics": "STATICALLY DETERMINATE BEAMS: Introduction, Types of Beams, Loads and Reactions, Shear Force and Bending Moments, Relationships between Load, Shear Force and Bending Moment, Shear Force and Bending Moment Diagrams. BENDING STRESSES IN STATICALLY DETERMINATE BEAMS: Introduction, Pure bending, Bending stress Equation, Design of beams for bending stresses."
      },
      {
        "unit_number": "3",
        "title": "Deflections of Beams and Columns",
        "topics": "DEFLECTIONS OF STATICALLY DETERMINATE BEAMS: Introduction, Differential Equations of the Deflection Curve, Deflections by Integration of the Bending Moment Equation, Macaulay’s Method. COLUMNS: Introduction,Buckling and Stability, Columns with Pinned ends, Columns with other support conditions, Limitations of Euler’s Formula, Rankine’s Formula."
      },
      {
        "unit_number": "4",
        "title": "Analysis of Plane Stress and Pressure Vessels",
        "topics": "ANALYSIS OF PLANE STRESS: Introduction, Plane Stress, Principal Stresses and Maximum Shear Stress.Mohr’s Circle for Plane Stress. THIN CYLINDRICAL AND SPHERICAL PRESSURE VESSELS: Introduction,Stressesinthincylindrical and spherical pressure vessels subjected to internal pressure. Effect of internal pressure on the dimensions of the thin cylindrical and spherical pressure vessels."
      }
    ],
    "books": {
      "textbooks": [
        "James M. Gere and Barry J.Goodno, “Mechanics of Materials”, Eighth edition, CENGAGE Learning, 2013",
        "R.K.Bansal, “Strength of Materials”Sixth edition,Laxmi Publishers, 2017"
      ],
      "reference_books": [
        "Dr. Sadhu Singh,”Strength of Materials”, Ninth edition, Khanna Publishers, 2007.",
        "R.K. Rajput,“Strength of Materials”,First Edition,S.Chand& Company, 2006.",
        "S.S.Rattan, “Strength of Materials”, Third Edition,Tata McGraw Hill Education Private Limited, 2017."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ME3305",
      "course_name": "Kinematics of Machines",
      "semester": "3",
      "category": "Professional Core",
      "credits": 3,
      "prerequisites": "23PC2104B Engineering Mechanics, 23ES1105 Engg. Graphics",
      "course_outcomes": [
        "Distinguish different Mechanisms and determine velocity of links using Instantaneous Centre Method.",
        "Evaluate velocity and acceleration of various links in a Mechanism",
        "Apply the analytical techniques for Synthesis of Mechanisms & Develop cam profiles",
        "Illustrate the concepts of toothed gearing and gear trains"
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Introduction to Mechanisms and Instantaneous Centre",
        "topics": "Mechanisms and machines, Link, Kinematic pair, Types of joints, Constrained motions, Degrees of Freedom, Mobility - Kutzbach criterion -Gruebler’s equation - Grashoff's law, Inversions of Mechanism- Four - bar chain, Single Slider - Crank Chain, Double – Slider Crank Chain. INSTANTANEOUS CENTRE: Kennedy's theorem, Locating Instantaneous centres, Angular velocity by Instantaneous centre Method for simple mechanisms."
      },
      {
        "unit_number": "2",
        "title": "Velocity and Acceleration Analysis",
        "topics": "Introduction, Absolute and Relative Motion, Vectors, Motion of a Link, Velocity and Acceleration, Angular velocity and Angular acceleration of Links: Four bar Mechanism, Velocity and Acceleration of Intermediate and offset points. Velocity and acceleration of Slider - Crank Mechanism, Coriolis acceleration of Crank and Slotted Lever Mechanism."
      },
      {
        "unit_number": "3",
        "title": "Kinematic Synthesis and Cams",
        "topics": "KINEMATIC SYNTHESIS: Stages of synthesis-Concepts of type, Number and dimensional synthesis - Tasks of dimensional synthesis, Concepts of function generation, Rigid body guidance and path generation, Freudenstein equation for function generation using three precision points for four bar mechanism. CAMS: Introduction, Classification of cams and followers, Terminology and definitions, Displacement diagrams – Uniform velocity, simple harmonic and uniform acceleration motions, Graphical synthesis of cam profile limited to reciprocating, radial & offset follower."
      },
      {
        "unit_number": "4",
        "title": "Gears and Gear Trains",
        "topics": "GEARS: Introduction, Classification of gears, Gear terminology, Law of Gearing, Velocity of Sliding, Forms of Teeth- Cycloidal Profile Teeth, Involute Profile Teeth. Path of contact, Arc of contact, Number of pairs of Teeth in contact, Concept of Interference in Involute Gears. GEAR TRAINS: Introduction, simple Gear Train, Compound Gear Train, Reverted Gear train, Planetary or Epicyclic Gear Train, Analysis of Epicyclic Gear Train using Tabular method only."
      }
    ],
    "books": {
      "textbooks": [
        "S.S.Rattan, Theory of Machines, 4th Edition, 2014, TMH.",
        "Amitabha Ghosh and Asok Kumar Mallik, Theory of Mechanisms and Machines, 3rd Edition,2006 East West Press"
      ],
      "reference_books": [
        "C S Sharma and Kamlesh Purohit, Theory of Mechanisms and Machines, Prentice Hall of India.",
        "Dr. R. K. Bansal & Dr. J. S. Brar, Theory of Machines 4th Edition, 2009, Lakshmi publications",
        "Robert L.Norton, Design of Machinery, 6rd Edition, 2019, McGraw-Hill Education."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23TP3106",
      "course_name": "Logic and Reasoning",
      "semester": "3",
      "category": "Soft Skills- I",
      "credits": 1,
      "prerequisites": "Not specified",
      "course_outcomes": [
        "Think reason logically in any critical situation",
        "Analyze given information to find correct solution",
        "To reduce the mistakes in day to day activities in practical life",
        "Develop time management skills by approaching different shortcut methods",
        "Use mathematical based reasoning to make decisions",
        "Apply logical thinking to solve problems and puzzles in qualifying exams for companies and in other competitive exams"
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Analytical Reasoning",
        "topics": "Series Completion, Coding-Decoding, Blood Relation, Puzzles test"
      },
      {
        "unit_number": "2",
        "title": "Logical Reasoning",
        "topics": "Direction sense test, Logical Venn diagrams, Number test, ranking test, Mathematical operations"
      },
      {
        "unit_number": "3",
        "title": "Abstract Reasoning",
        "topics": "Arithmetical Reasoning, Inserting missing character, Syllogism, Binary logic, Data sufficiency"
      },
      {
        "unit_number": "4",
        "title": "Non-Verbal Reasoning",
        "topics": "Water images, Mirror images, Paper folding, Paper cutting, Embedded Figures, Dot situation, Cubes & Dice"
      }
    ],
    "books": {
      "textbooks": [
        "R. S. Aggarwal, “ Verbal and non-verbal reasoning”, Revised Edition, S Chand publication, 2017 ISBN:81-219-0551-6,",
        "Reasoning Guru Verbal & Non-Verbal Reasoning by Vikramjeeth, Multilingual Edition-2023. ISBN :978-9358706000"
      ],
      "reference_books": []
    }
  },
  {
    "metadata": {
      "course_code": "23MC3107",
      "course_name": "Environmental Science",
      "semester": "3",
      "category": "Audit Course",
      "credits": 0,
      "prerequisites": "Consciousness of Environment",
      "course_outcomes": [
        "Identify various factors causing degradation of natural resource and control measures",
        "Identify various ecosystems and need for biodiversity",
        "Interpret the problems related to environmental pollution and its Management",
        "Apply the information and technology to analyze social issues"
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Environmental Studies and Natural Resources",
        "topics": "Definition, scope and importance, Need for public awareness. Natural Resources: Renewable and Non-renewable Resources (Forest, Water, Mineral, Food, Energy, Land) - Use, over-exploitation, and conservation."
      },
      {
        "unit_number": "2",
        "title": "Ecosystems and Biodiversity",
        "topics": "Ecosystems: Concept, structure, and function. Energy flow, ecological succession, food chains, food webs. Types of ecosystems. Biodiversity and Its Conservation: Genetic, species, and ecosystem diversity. Value, threats, and conservation of biodiversity."
      },
      {
        "unit_number": "3",
        "title": "Environmental Pollution and Disaster Management",
        "topics": "Definition, Causes, effects and control measures of Air, Water, Soil, Marine, Noise, Thermal pollution, and Nuclear hazards. Solid waste management. Disaster management: Floods, earthquake, cyclone and landslides."
      },
      {
        "unit_number": "4",
        "title": "Social Issues and the Environment",
        "topics": "Sustainable development, Water conservation, Environmental ethics. Climate change, global warming, acid rain, ozone layer depletion. Environment Protection Act. Human Population and the Environment. Field Work/ Case Studies."
      }
    ],
    "books": {
      "textbooks": [
        "ErachBharucha. 2004, Environmental Studies for undergraduate courses, University Grants Commission, New Delhi, BharatiVidyapeeth Institute of Environment Education and Research."
      ],
      "reference_books": [
        "AnjaneyuluY. Introduction to Environmental sciences, B S Publications PVT Ltd, Hyderabad",
        "Anjireddy.M Environmental science & Technology, BS Publications PVT Ltd, Hyderabad.",
        "Benny Joseph, 2005, Environmental Studies, The Tata McGraw- Hill publishing company limited, New Delhi."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ME3651",
      "course_name": "Programmable logic controllers Lab",
      "semester": "3",
      "category": "Skill oriented Course",
      "credits": 1,
      "prerequisites": "Nil",
      "course_outcomes": [
        "Demonstrate knowledge of basic ladder logic instructions like timers, counters etc. used to program PLCs.",
        "Apply PLC ladder programming for simple industrial processes.",
        "Analyze the performance of PLC based systems.",
        "Make use of various vendors PLCs to perform experiments as individual or team"
      ]
    },
    "syllabus": [
      {
        "unit_number": "Lab",
        "title": "List of Experiments",
        "topics": [
          "Implementation of logic gates using PLC ladder diagram (LD)",
          "Implementation of timers using PLC",
          "Implementation of counters using PLC",
          "Positive and negative edge detection in PLC",
          "Level control using PLC",
          "Pressure control using PLC",
          "Temperature control using PLC",
          "Motor speed control using PLC",
          "Automation of material handling system using PLC",
          "Automatic pneumatic stamping machine using PLC",
          "Automatic drilling system using PLC",
          "Elevator control using PLC"
        ]
      }
    ],
    "books": {
      "textbooks": [],
      "reference_books": []
    }
  },
  {
    "metadata": {
      "course_code": "23ME3352",
      "course_name": "Solid Modeling Laboratory",
      "semester": "3",
      "category": "Professional Core",
      "credits": 1.5,
      "prerequisites": "23ES1105 Engineering Graphics",
      "course_outcomes": [
        "Construct 2D sketches in a modelling software",
        "Develop part models of machine components",
        "Combine part models of machine components for assembly",
        "Translate geometric models to other file formats."
      ]
    },
    "syllabus": [
      {
        "unit_number": "Lab",
        "title": "List of Experiments",
        "topics": [
          "Construction of 2D sketches.",
          "Modelling of simple machine components.",
          "Assembly of Machine components.",
          "Orthographic views of the assembled components.",
          "Solid modelling of real components",
          "Exporting the files to other file formats",
          "Group assignment topics (e.g., Screw jack, Stuffing Box, Connecting rod end, Tool post, Socket and spigot joint, Foot-step bearing, GI pipe fittings, Butt joint)"
        ]
      }
    ],
    "books": {
      "textbooks": [
        "Pro/Engineer Wildfire 5.0 by Roger Toogood, Jack Zecher, SDC Publications.",
        "Machine Drawing by K.L Narayana, P.Kannaiah, K.Venkata Reddy, Publisher: New Age International"
      ],
      "reference_books": [
        "Parametric Modeling with Pro/ENGINEER Wildfire 5.0",
        "Parametric Modeling with Creo Parametric 1.0"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ME3353",
      "course_name": "Computational Methods Lab",
      "semester": "3",
      "category": "Professional Core",
      "credits": 1.5,
      "prerequisites": "23BS2101Differential Equations & Vector Calculus, 23PC2104B Engineering Mechanics",
      "course_outcomes": [
        "Illustrate basic commands in MATLAB and perform matrix Operations",
        "Evaluate linear equations, Numerical integration and ODE using FDM",
        "Intercept Engineering Mechanics and Strength of Materials Problems",
        "Solve Thermal Engineering Problems"
      ]
    },
    "syllabus": [
      {
        "unit_number": "Lab",
        "title": "List of Experiments",
        "topics": [
          "Basic MATLB Commands, functions and plot commands",
          "Scalars, vectors and Matrix Operations",
          "Solution of System of Linear Equations",
          "Numerical Integration and Differentiation",
          "Solution of ODE problem using FDM Method",
          "Solution to simple Engineering Mechanics Problem",
          "Solution to simple Vibration Problem",
          "Solution to simple Strength of Materials Problem",
          "Solution to simple Thermodynamics Problem",
          "Solution to simple Fluid Dynamics Problem",
          "Solution to simple Heat Transfer Problem"
        ]
      }
    ],
    "books": {
      "textbooks": [
        "Solving Mechanical Engineering Problems with MATLAB, 2nd Edition, Simin Nasseri,Linus Learning (2022)"
      ],
      "reference_books": [
        "MATLAB programming by Y.Kirani Singh &B.B.Chaudhuri. PHI Publications (2010).",
        "Getting started with MATLAB -a quick reference for scientists & engineers by RudraPratap. Oxford University Press (2009).",
        "An introduction to programming and numerical methods in MATLAB by S.R.Otto, J.P.Denier. Springer Publications (2007)"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23HS4101",
      "course_name": "Engineering Economics and management",
      "semester": "4",
      "category": "Management Course",
      "credits": 2,
      "prerequisites": "Not specified",
      "course_outcomes": [
        "Understand the principles of management and various forms of organizations.",
        "Understand the various aspects of business economics.",
        "Perceive the knowledge on Human resources and Marketing functions.",
        "Evaluate various alternatives economically and methods of calculating depreciation."
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Management and Business Organization",
        "topics": "Introduction to Management, Functions of Management, Principles of Scientific Management, Modern Principles of Management. Forms of Business Organization: Salient Features of Sole Proprietorship, Partnership, Joint Stock Company, Co-operative Society and Public Sector."
      },
      {
        "unit_number": "2",
        "title": "Economics, Demand, and Supply Analysis",
        "topics": "Introduction to Basic Economic Concepts, Utility Analysis: Marginal Utility and Total Utility, Law of Diminishing Marginal Utility, Law of Equi Marginal Utility. Demand Analysis: Theory of Demand, Factors Influencing Demand, Elasticity of Demand. Supply Analysis: Supply Schedule and Supply Curve, Factors Influencing Supply."
      },
      {
        "unit_number": "3",
        "title": "Human Resource and Marketing Management",
        "topics": "Human Resource Management: Meaning and difference between Personnel Management and Human Resource Management, Functions of Human Resource Management. Marketing Management: Concept of Selling And Marketing– Differences, Functions of Marketing, Product Life Cycle, Concept of Advertising, Sales Promotion, Types of Distribution Channels, Marketing Research, Break-Even Analysis."
      },
      {
        "unit_number": "4",
        "title": "Financial Management and Economic Alternatives",
        "topics": "Financial Management: Functions of Financial Management, Time value of money with cash flow diagrams, Concept of Simple and Compound Interest. Economic Alternatives: Methods of Evaluating Alternatives under Present worth method, Future worth method, Annual Equivalent method- Problems. Depreciation: Causes of depreciation, Factors influencing depreciation, common methods of Depreciation: Straight Line Method, Declining Balance Method, Sum of Year’s Digits Method–Problems."
      }
    ],
    "books": {
      "textbooks": [
        "M. MahajanIndustrial Engineering and Production Management Dhanpat Rai Publications2nd Edition.",
        "Martand Telsang” Industrial & Business Management” S.Chand publications"
      ],
      "reference_books": [
        "R.Paneerselvam “Production and Operations Management” PHI",
        "Philip Kotler & Gary Armstrong “Principles of Marketing” ,pearson prentice Hall,New Delhi,2012 Edition.",
        "IM Pandey, “Financial Management” Vikas Publications 11th Edition",
        "B.B Mahapatro, “Human Resource Management”.,New Age International ,2011"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ES4102D",
      "course_name": "Engineering Metallurgy",
      "semester": "4",
      "category": "Engineering Science",
      "credits": 3,
      "prerequisites": "23BS2102 Engineering Physics, 23BS1102A Engineering Chemistry",
      "course_outcomes": [
        "Recognize the importance and concept of materials and solid solutions.",
        "Exemplify the phase diagrams and TTT diagrams of steels.",
        "Classify theheat treatment processes and strengthening mechanisms.",
        "Outlinethe principles of powder metallurgy and manufacturing methods of different types of composites."
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Introduction to Material Science and Solid Solutions",
        "topics": "INTRODUCTION TO MATERIAL SCIENCE: Material Science, Classification of materials, Requirement and selection of materials, Mechanical properties of materials. INTRODUCTION TO CRYSTALLOGRAPHY:Space Lattice, Unit Cell, Bravais Lattices, Coordination number, Atomic Packing Factor for SCC, BCC and FCC,Crystal imperfections, Crystal deformation- Slip and Twinning. SOLID SOLUTIONS: Introduction, Substitutional solid solutions, Hume Rothery’s rule, Interstitial solid solution."
      },
      {
        "unit_number": "2",
        "title": "Phase Diagrams and TTT Diagrams",
        "topics": "PHASE DIAGRAMS: Binary phase diagrams – Phase rule – one component system, two component system, isomorphous, eutectic, eutectoid, peritectic and peritectoid systems, Fe-Fe3C equilibrium diagram. TTT Diagrams: TTT diagrams for eutectoid, hypo and hyper eutectoid steels."
      },
      {
        "unit_number": "3",
        "title": "Heat Treatment and Strengthening Mechanisms",
        "topics": "HEAT TREATMENT PROCESSES: Annealing, normalizing, hardening, tempering, austempering, martempering, flame Hardening, Induction Hardening & Chemical hardening techniques, hardenability concept and experimental determination. STRENGTHENING MECHANISMS: Strain hardening, solid solution strengthening, grain refinement, dispersion strengthening."
      },
      {
        "unit_number": "4",
        "title": "Powder Metallurgy and Composite Materials",
        "topics": "POWDER METALLURGY: Powder metallurgy process, preparation of powders, Characteristics of metal powders, mixing and blending, compacting, sintering, Applications of Powder Metallurgy. COMPOSITE MATERIALS:Introduction, Classification of composites, Characteristics, Advantages and Dis-advantages, applications, various methods of component manufacture of composites – Hand Lay-up method, Resin transfer moulding, Filament winding process, and continuous pultrusion process."
      }
    ],
    "books": {
      "textbooks": [
        "Kodgirie .V.D and Kodgirie.S.V, “Material Science and Metallurgy”, Thirty-seventh Edition, Everest House Publication, 2015.",
        "Raghavan.V, “ Material Science and Metallurgy” ,Fifth Edition, PHI Learning Pvt Limited,2013"
      ],
      "reference_books": [
        "Avener , “Introduction to Physical Metallurgy”, Second Edition, Tata McGraw hill Education (India) Pvt Limited,1997.",
        "Rajput R. K,“Material Science and Engineering”, Fourth Edition, S.K.kataria& Sons,2009.",
        "C. Daniel Yesudian, D.G.Harris Samuel, “Material Science and Metallurgy”, First Edition, SCITECH, 2006."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ME4303",
      "course_name": "Manufacturing Processes",
      "semester": "4",
      "category": "Professional Core",
      "credits": 3,
      "prerequisites": "23ES2103A Basic Mechanical Engineering.",
      "course_outcomes": [
        "Describe the Methodology of the casting processes.",
        "Distinguish the special casting methods and their applications.",
        "Familiarize with various Bulk Deformation and Sheet Metal operations.",
        "Illustrate various Welding processes with applications."
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Metal Casting Processes",
        "topics": "Introduction to Manufacturing Processes, Sand casting - General method, pattern: types, materials and allowances, Molding Sand – Materials, preparation and properties, Types of Cores, Gating system and Risers: Types, Functions and Design. Solidification process and time estimation. Classification of Furnace: Constructional Features, Working Principle and Zones of Cupola Furnace, Electric Furnace – Arc."
      },
      {
        "unit_number": "2",
        "title": "Special Metal Casting Methods",
        "topics": "Permanent Mold Casting, Die Casting: Hot chamber die casting- Cold chamber die casting, Centrifugal Casting: True Centrifugal Casting, Semi-centrifugal Casting and Centrifuging. Investment casting - Shell Mold Casting - CO2 casting Process and Continuous Casting. Casting defects: Causes and Remedies."
      },
      {
        "unit_number": "3",
        "title": "Bulk Deformation and Sheet metal operations",
        "topics": "Bulk Deformation Processes: Fundamentals, Hot and Cold working of metals - Rolling- Forging- Extrusion -Tube Making, and Wire Drawing. High Energy Rate Forming Processes: Explosive Forming, Electro Hydraulic Forming, Electro Magnetic Forming. Sheet metal operations: Introduction, Sheet metal Blanking - Punching operations. Clearance and Shear as applied to Punching/Blanking operations, Elastic recovery in bending operation."
      },
      {
        "unit_number": "4",
        "title": "Metal Joining Welding Processes",
        "topics": "Welding Processes: Fundamentals and classification of welding, Gas welding Processes: Working Principle of Oxy-acetylene Gas Welding, Arc Welding: TIG - MIG – Arc blow, Duty cycle. Resistance Welding: Principles of Resistance Welding - Types: Butt Welding, Spot Welding, Seam Welding. Special welding Processes: Electron beam welding, Thermit Welding, Electro slag welding, Laser beam welding, Friction Welding, Friction stir Welding, Under Water Welding and Brazing & Soldering. Welding defects: Causes and Remedies."
      }
    ],
    "books": {
      "textbooks": [
        "Manufacturing Technology by P.N. Rao,Vol.1, Edition-3, 2009, TMH.",
        "Production Technology (Manufacturing Processes) by P.C. Sharma, 2007, S. Chand Publishers."
      ],
      "reference_books": [
        "Welding and welding Technology by Richard.L.Little,1973, McGraw Hill.",
        "Principles of Metal Casting by Heine, Loper, Rosenthal.33rd Reprint, 2008, TMH."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ME4304",
      "course_name": "Fluid Mechanics and Hydraulic Machines",
      "semester": "4",
      "category": "Professional Core",
      "credits": 3,
      "prerequisites": "Not specified",
      "course_outcomes": [
        "Evaluate the fluid properties and analyze the fluid flow",
        "Apply the knowledge of fluid dynamics for flow analysis and analyze the losses in pipes",
        "Apply the momentum principle in impact of jets & analyze the flow in boundary layer",
        "Analyze the performance of hydraulic turbines and pumps"
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Fluid Properties and Fluid Statics",
        "topics": "Density, Specific weight, Specific gravity, viscosity, Surface Tension, Capillarity, Types of Fluids, Vapour pressure, Compressibility, Pressure and its measurements (Treatment limited to Manometers). FLUID KINEMATICS: Stream line, path line, streak line, stream tube, classification of flows, one and three dimensional continuity equation."
      },
      {
        "unit_number": "2",
        "title": "Fluid Dynamics and Pipe Flow",
        "topics": "FLUID DYNAMICS: Surface and Body forces - Euler's equation of motion and Bernoulli's equation from Euler’s equation, applications of Bernoulli's equation. INTERODUCTION TO PIPE FLOW: Reynolds’s experiment, Darcy-Weisbach equation, Minor losses in pipes (Treatment limited to explanation), flow through pipes in series and parallel, Hydraulic gradient and total energy lines."
      },
      {
        "unit_number": "3",
        "title": "Boundary Layer and Turbo Machinery",
        "topics": "BOUNDARY LAYER CONCEPTS: Definition, Displacement Thickness, Momentum thickness, Energy Thickness, Drag and lift (Treatment limited to concept only). INTERODUCTION TO TURBO MACHINERY: Review of momentum equation, Impact of jet of water on various configurations and derivation of force applied by jet in all applications, Introduction to velocity triangles and applications."
      },
      {
        "unit_number": "4",
        "title": "Hydraulic Turbines and Pumps",
        "topics": "HYDRAULIC TURBINES: Classification of turbines, Pelton wheel construction and working principle, Francis and Kaplan turbines detailed discussion, Heads, Efficiencies and Performance of turbines. HYDRAULIC PUMPS: Classification of pumps with definition, Working Principles and work done by Centrifugal and Reciprocating pumps."
      }
    ],
    "books": {
      "textbooks": [
        "R.K.Bansal, “Fluid Mechanics & Hydraulic Machines” Tenth Edition, Laxmi Publications, 2023.",
        "Robert W. Fox , Alan T. McDonald and Philip J. “Fluid Mechanics” Eighth edition, Wiley Publishers."
      ],
      "reference_books": [
        "P.N.Modi & S.M. Seth.,” Hydraulics and Fluid Mechanics”, Second Edition, Standard Book House, 2005.",
        "R.K. Rajput,“ Fluid Mechanics & Hydraulic Machines”, Ninth Edition, S.Chand & Company, 2015.",
        "D.S.Kumar, “Fluid Mechanics & Fluid Power Engineering”, Second Edition, S.K.Kataria & Sons Publishers, 2014."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ME4305",
      "course_name": "Machine Dynamics",
      "semester": "4",
      "category": "Professional Core",
      "credits": 3,
      "prerequisites": "23PC2104B Engineering Mechanics",
      "course_outcomes": [
        "Analyze balancing of rotating and reciprocating masses.",
        "Examine the speed of governors and gyroscopic effects on vehicles.",
        "Apply the concepts of energy fluctuations in fly wheels.",
        "Calculate natural frequency for longitudinal, transverse and torsional vibrations."
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Balancing of Rotating and Reciprocating Systems",
        "topics": "BALANCING OF ROTATING SYSTEMS: Introduction, Static balancing, Dynamic balancing, Transferring of a Force from one plane to another, Balancing of Several Masses in Different planes. BALANCING OF RECIPROCATING SYSTEMS: Primary balancing only."
      },
      {
        "unit_number": "2",
        "title": "Governors and Gyroscopes",
        "topics": "GOVERNORS: Introduction, Watt Governor, Porter Governor, Hartnell Governor, Sensitiveness of a Governor, Hunting, Isochronism, Stability. GYROSCOPES: Angular Velocity, Angular Acceleration, Gyroscopic Torque, Gyroscopic Effect on Air-planes and Naval Ships"
      },
      {
        "unit_number": "3",
        "title": "Turning Moment Diagrams and Flywheels",
        "topics": "TURNING MOMENT DIAGRAMS: Introduction, Single - cylinder double – acting steam engine, Single - cylinder four stroke engine, Multi-cylinder engine, Fluctuation of energy, determination of maximum fluctuation of energy, coefficient of fluctuation of energy. FLY WHEELS: Introduction, Coefficient of fluctuation of speed, energy stored in fly wheel."
      },
      {
        "unit_number": "4",
        "title": "Undamped Free Vibrations",
        "topics": "LONGITUDINAL VIBRATION: Introduction, Definitions, Types of vibrations, Basic features of vibrating systems, Degree of freedom, free longitudinal vibrations. TRANSVERSE VIBRATION: Single concreted load, shaft carrying several loads, whirling of shafts. TORSIONAL VIBRATION: Single rotor systems and two rotor systems, Torsionally equivalent shafts."
      }
    ],
    "books": {
      "textbooks": [
        "S.S.Rattan, “Theory of Machines”, Fifth edition, McGraw Hill Education (India) Private Limited, 2014",
        "Dr.R.K.Bansal & Dr.J.S.Brar,” Theory of Machines”, Fourth edition, Laxmi Publications (P) Limited, 2009."
      ],
      "reference_books": [
        "R.S.Khurmi & J.K.Guptha,“ Theory of Machines”, 14th Edition, S.Chand & Company, 2006.",
        "V.P.Singh,”Mechanical vibrations”, Second Edition, Dhanpat Rai & Co (P) Limited, 2009"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23TP4106",
      "course_name": "English for Professionals",
      "semester": "4",
      "category": "Soft skills -2",
      "credits": 1,
      "prerequisites": "Not specified",
      "course_outcomes": [
        "Understand how to listen, reflect, and speak while communicating with others.",
        "Recall the fundamentals of language in terms of grammar and vocabulary in communication.",
        "Apply English language skills in various speaking contexts to present ideas with clarity and accuracy.",
        "Analyze the different parts in Versant Test and answer them."
      ]
    },
    "syllabus": [
      {
        "unit_number": "N/A",
        "title": "Course Topics",
        "topics": "Conversation Starters, Functional Conversations, Grammar (Verbs, Tenses, Sentence Structures, Spotting Errors), Just A Minute (JAM), Vocabulary (Idioms, Phrases), Elocution, Extempore, Debate, Versant Test, Story Telling"
      }
    ],
    "books": {
      "textbooks": [
        "English for Professionals Lab Manual"
      ],
      "reference_books": [
        "Wren & Martin. English Grammar and Composition. S.Chand & Company, 2023.",
        "Dale Carnegie. The Quick and Easy way to Effective Speaking. Rupa Publications, 2016.",
        "Richard A. Spears. McGraw-Hill’s Dictionary of American Idioms and Phrasal Verbs. McGraw Hill, 2005.",
        "Kamalesh Sadanand. A Spoken English. VOL 1&2, Orient BlackSwan, Second Edition, 2014."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ES4651",
      "course_name": "Python Programming Lab",
      "semester": "4",
      "category": "Skill oriented course",
      "credits": 1,
      "prerequisites": "23ES1104 -Introduction to programming",
      "course_outcomes": [
        "Solve the different methods for linear, non-linear and differential equations",
        "Learn the PYTHON Programming language",
        "Familiar with the strings and matrices in PYTHON",
        "Write the Program scripts and functions in PYTHON to solve the methods",
        "Evaluate different methods of numerical solutions"
      ]
    },
    "syllabus": [
      {
        "unit_number": "Lab",
        "title": "List of Experiments",
        "topics": [
          "To find the roots of non-linear equation using Newton Raphson’s method.",
          "Curve fitting by least – square approximations",
          "To solve the system of linear equations using Gauss - elimination method",
          "To solve the system of linear equations using Gauss - Siedal method",
          "To solve the system of linear equations using Gauss - Jordan method",
          "To integrate numerically using Trapezoidal rule",
          "To integrate numerically using Simpsons rule",
          "To find the largest eigen value of a matrix by Power – method",
          "To find numerical solution of ordinary differential equations by Euler’s method",
          "To find numerical solution of ordinary differential equations by Runge-Kutta method",
          "To find numerical solution of ordinary differential equations by Milne’s method",
          "To find the numerical solution of Laplace equation",
          "To find the numerical solution of Wave equation",
          "To find the solution of a tri-diagonal matrix using Thomas algorithm",
          "To fit a straight using least square technique"
        ]
      }
    ],
    "books": {
      "textbooks": [],
      "reference_books": []
    }
  },
  {
    "metadata": {
      "course_code": "23ES4152",
      "course_name": "Design Thinking & Innovation",
      "semester": "4",
      "category": "Engineering Science",
      "credits": 2,
      "prerequisites": "Social Needs, Customer needs & market needs",
      "course_outcomes": [
        "Able to define basic design components, Design thinking components and process",
        "Apply the design thinking techniques for solving problems in various sectors.",
        "Analyse to work in a multidisciplinary environment.",
        "Evaluate the value of creativity."
      ]
    },
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Introduction to Design Thinking & Design Thinking Process",
        "topics": "Introduction to elements and principles of Design components, history of Design Thinking, New materials in Industry. Design thinking process (empathize, analyze, idea & prototype), implementing the process in driving inventions, design thinking in social innovations. Tools of design thinking - person, costumer, journey map, brainstorming, product development"
      },
      {
        "unit_number": "2",
        "title": "Innovation",
        "topics": "Art of innovation, Difference between innovation and creativity, role of creativity and innovation in organizations. Creativity to Innovation. Teams for innovation, Measuring the impact and value of creativity."
      },
      {
        "unit_number": "3",
        "title": "Product Design",
        "topics": "Problem formation, introduction to product design, Product strategies, Product value, Product planning, product specifications. Innovation towards product design Case studies."
      },
      {
        "unit_number": "4",
        "title": "Design Thinking in Business Processes",
        "topics": "Design Thinking applied in Business & Strategic Innovation, Design Thinking principles that redefine business – Business challenges. Design thinking to meet corporate needs. Design thinking for Startups. Defining and testing Business Models and Business Cases. Developing & testing prototypes."
      }
    ],
    "books": {
      "textbooks": [
        "Tim Brown, Change by design, 1/e, Harper Bollins, 2009.",
        "Idris Mootee, Design Thinking for Strategic Innovation, 1/e, Adams Media, 2014."
      ],
      "reference_books": [
        "David Lee, Design Thinking in the Classroom, Ulysses press, 2018.",
        "Shrrutin N Shetty, Design the Future, 1/e, Norton Press, 2018.",
        "William lidwell, Kritinaholden, & Jill butter, Universal principles of design, 2/e, Rockport Publishers, 2010.",
        "Chesbrough.H, The era of open innovation, 2003."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ME4353",
      "course_name": "SM &FM Laboratory",
      "semester": "4",
      "category": "Professional Core",
      "credits": 1.5,
      "prerequisites": "23 PC 2104 B Engineering Mechanics, 23 ME 3104 Mechanics of Materials, 23 ME 3204 Fluid Mechanics & Hydraulic Machines",
      "course_outcomes": [
        "Determine Young’s modulus using UTM",
        "Evaluate hardness, Tensile, compressive, shear and impact strengths as per IS code of Practice",
        "Measure the rigidity modulus by conducting torsion test on Mild Steel",
        "Determine the coefficient of discharge for Venturimeter, orifice, orificemeter & Mouthpiece",
        "Determine the Friction factor for a given pipe",
        "Evaluate and analyse the characteristics of Centrifugal pumps, Reciprocating Pumps and Gear pumps"
      ]
    },
    "syllabus": [
      {
        "unit_number": "Lab",
        "title": "List of Experiments",
        "topics": "Strength of Materials Lab: Determination of Young’s modulus for Mild Steel, Load vs Deflection on cantilever and simply supported beam, Compression test, Rockwell and Brinnell's Hardness Test, Impact Test (Charpy and lzod), Torsion test, Double shear Test. Fluid Mechanics Lab: Determination of coefficient of discharge for Orifice/mouthpiece and Venturimeter/Orifice meter, Determination of friction factor for a given pipe, Operating characteristics of Single-stage centrifugal pump, Single-acting reciprocating pump, and Gear pump."
      }
    ],
    "books": {
      "textbooks": [],
      "reference_books": [
        "James M. Gere and Barry J. Goodno, “Mechanics of Materials” Seventh edition, CENGAGE Learning, 2019",
        "R.K.Bansal, “Fluid Mechanics & Hydraulic Machines” Fifth edition, Laxmi Publishers, 2020",
        "Dr. Sadhu Singh,”Strength of Materials” Ninth edition, Khanna Publishers, 2017.",
        "P.N.Modi & S.M. Seth.,”Hydraulics and Fluid Mechanics”, Second edition, Standard Book House, 2015."
      ]
    }
  },
  {
    "metadata": {
      "course_code": "23ME4354",
      "course_name": "Manufacturing Process Laboratory",
      "semester": "4",
      "category": "Professional Core",
      "credits": 1.5,
      "prerequisites": "23ME3203 Manufacturing Processes",
      "course_outcomes": [
        "Develop various joints using fitting.",
        "Create various welding joints.",
        "Build various sand casting moulds.",
        "Construct various models using 3D printing."
      ]
    },
    "syllabus": [
      {
        "unit_number": "Lab",
        "title": "List of Experiments",
        "topics": "FITTING: Half round Joint, Stepped Joint, Dovetail Joint. WELDING: Lap Joint (Oxy Acetylene), ‘T’– Joint (MIG), Spot joint (Resistance). FOUNDRY: Single piece pattern, Two piece pattern (Step Cone Pulley), Two piece pattern (Double end pipe flange). 3D PRINTING: Bolt &Nut, Screw feeder, Gear wheel. PROJECT: To prepare a metal Casting (Automobile component) – Group assignment."
      }
    ],
    "books": {
      "textbooks": [
        "S.K.HajraChowdary, A.K. HajraChowdary, NirjharRoy,”Elements of Workshop Technology, Vol.I”.Media Promoters and Publishers Pvt.Ltd, Mumbai,Scitech Publications, Chennai, 2013"
      ],
      "reference_books": []
    }
  }
]