[
  {
    "metadata": {
      "course_code": "24MA203",
      "course_name": "Probability and Statistics",
      "semester": "3",
      "category": "Basic Sciences (BS)",
      "credits": 4,
      "L-T-P": "4-0-0",
      "course_type": "Theory",
      "prerequisites": "Linear Algebra, Series, and Calculus"
    },
    "course_description": "This course provides a comprehensive understanding of probability and statistics, focusing on theoretical foundations and practical applications. Students will explore fundamental concepts such as probability distributions, statistical inference, hypothesis testing, and data analysis techniques. Key topics include discrete and continuous probability distributions (Binomial, Poisson, Normal), joint distributions, and the Central Limit Theorem. Emphasizing real-world applications, students will develop problem-solving skills to analyze data, model uncertainties, and make informed decisions based on statistical reasoning.",
    "course_outcomes": [
      "Explain probability distributions, joint distributions, and the Central Limit Theorem.",
      "Interpret confidence intervals and hypothesis testing for statistical inference.",
      "Apply probability and statistical methods to real-world problems.",
      "Analyze datasets to estimate parameters and test hypotheses.",
      "Evaluate probabilistic models using computational tools for decision-making."
    ],
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Probability Distributions and Random Variables",
        "topics": "Probability Distributions: Random Variables, Binomial distribution, Hypergeometric Distribution, Poisson approximation to the Binomial distribution, Poisson process."
      },
      {
        "unit_number": "2",
        "title": "Probability Densities and Joint Distributions",
        "topics": "Probability Densities: Continuous random variables, Normal distribution, Normal approximation to the Binomial distribution. Joint distribution: Joint Distributions-Discrete and Continuous."
      },
      {
        "unit_number": "3",
        "title": "Statistical Inference",
        "topics": "Inferences Concerning a Mean: Point Estimation- Interval Estimation, Tests of Hypotheses, Null Hypotheses and Tests of Hypotheses, Hypotheses concerning one mean, Relation between tests and confidence intervals, Comparisons-Two independent large samples, Comparisons-Two independent small samples."
      },
      {
        "unit_number": "4",
        "title": "Variances and Proportions",
        "topics": "Inferences Concerning Variances: Estimation of variances, Hypotheses concerning one variance, Hypotheses concerning two variances. Inferences Concerning Proportions: Estimation of Proportions, Hypotheses concerning one Proportion, Hypotheses concerning several Proportions, The analysis of r x c tables."
      },
      {
        "unit_number": "5",
        "title": "Non-Parametric Statistical Tests",
        "topics": "Non parametric Tests: Introduction, The Sign Test, Rank-Sum tests, Correlation based on ranks, Tests of Randomness."
      }
    ],
    "books": {
      "textbooks": [
        "R. A. Johnson, Probability and Statistics for Engineers, 8th Edition, Prentice Hall India Learning Private Limited, 2011."
      ],
      "reference_books": [
        "R. E. Walpole, R. H. Myers, S. L. Myers, and K. Ye, Probability and Statistics for Engineers and Scientists, 5th Edition, Macmillan, New York, 1993.",
        "P. C. Biswal, Probability and Statistics, Prentice Hall India Learning Private Limited, 2007.",
        "T. K. V. Iyengar, B. K. Gandhi, S. Ranganadham, and M. V. S. S. N. Prasad, Probability and Statistics, S. Chand Publishing, 2008."
      ],
      "web_resources": [
        "https://nptel.ac.in/courses/111105090",
        "https://nptel.ac.in/courses/111102112",
        "https://nptel.ac.in/courses/111105042"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "24CS201",
      "course_name": "Digital Logic Design",
      "semester": "3",
      "category": "Engineering Sciences (ES)",
      "credits": 3,
      "L-T-P": "3-0-0",
      "course_type": "Theory",
      "prerequisites": "Not specified"
    },
    "course_description": "Digital Logic Design provides an in-depth introduction to the principles and techniques used in the design and analysis of digital systems. Students will explore the fundamentals of digital logic, the building blocks of modern computing systems, and their applications in hardware design. The course emphasizes both combinational and sequential logic circuits, digital number systems, Boolean algebra, analysis, design, and evaluation of digital circuits of medium complexity. The main objectives are to provide knowledge on methods for simplifying Boolean functions and to develop skills for design of various combinational & sequential logic circuits.",
    "course_outcomes": [
      "Understand Number systems and Boolean algebra.",
      "Apply simplification techniques to minimize Boolean functions.",
      "Apply combinational logic concepts to design and implement MSI and LSI circuits.",
      "Apply sequential logic principles to design clocked sequential circuits using flip-flops.",
      "Apply sequential logic techniques to design Counters, Registers and Memory elements."
    ],
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Number Systems, Boolean Algebra, and Logic Gates",
        "topics": "Binary Systems: Digital computers and digital systems, Number systems, conversions, Complements, Binary Codes, Representation of integers and Floating-point numbers. Boolean Algebra and Logic Gates: Basic Definitions, Axiomatic definition of Boolean Algebra, Basic theorems and Properties, Boolean functions, Canonical and Standard Forms, Digital Logic Gates."
      },
      {
        "unit_number": "2",
        "title": "Boolean Function Simplification and Combinational Logic Design",
        "topics": "Simplification of Boolean Functions: The Map Method, Tabulation Method. Combinational Logic: Design Procedure, Adders, Subtractors, Code Conversion, Analysis Procedure, Exclusive-or Gates, Parity Generators and Checkers."
      },
      {
        "unit_number": "3",
        "title": "Combinational Circuits and Programmable Logic Devices",
        "topics": "Combinational Logic with MSI and LSI: Binary Parallel Adder, Decimal Adder, Magnitude Comparator, Decoders, demultiplexers, encoders, Multiplexers. Programmable Logic: PLD, PROM, PLA, PAL, Introduction to FPGA."
      },
      {
        "unit_number": "4",
        "title": "Sequential Logic and State Machine Design",
        "topics": "Sequential Logic: Sequential circuits, Classification, Latches, Flip Flops, Triggering of Flip-Flops, Master-slave flip-flop, Flip-Flop Excitation tables. Analysis of Clocked Sequential Circuits: State table, State diagram, state equations, State Reduction and Assignment, Design Procedure."
      },
      {
        "unit_number": "5",
        "title": "Registers, Counters, and Memory Units",
        "topics": "Registers, Shift Registers, Asynchronous Counters, Synchronous Counters, Ring Counter, Johnson Counter, Timing Sequences. Memory Units: Block diagram of memory unit, Design of ROM and RAM, Classification of ROMs and RAMs."
      }
    ],
    "books": {
      "textbooks": [
        "M.Morris Mano, Digital Logic & Computer Design 1 e/d reprint, Pearson education, 2016.",
        "M.Morris Mano, Michael D Ciletti Digital Design with an Introduction to Verilog HDL 5th e/d, Pearson education, 2013."
      ],
      "reference_books": [
        "A. Anand Kumar, Switching Theory and Logic Design, 2nd Edition, PHI, 2013.",
        "Charles H.Roth, Fundamentals of Logic Design, 6/e, Cengage learning, 2010.",
        "Computer Architecture and Organization Designing for Performance, William Stallings, Ninth edition, Pearson Education series, 2014."
      ],
      "web_resources": [
        "https://nptel.ac.in/courses/108/106/108106177/",
        "https://nptel.ac.in/courses/106/108/106108099/"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "24CS202",
      "course_name": "Object Oriented Programming Through Java",
      "semester": "3",
      "category": "Program Core (PC)",
      "credits": 3,
      "L-T-P": "3-0-0",
      "course_type": "Theory",
      "prerequisites": "Programming using 'C'"
    },
    "course_description": "The course provides a comprehensive introduction to Java programming, focusing on fundamental constructs, object-oriented principles, and advanced features. It begins with the evolution of Java, basic syntax, data types, and control structures. Students will explore classes, objects, inheritance, and string handling to build modular and reusable code. The course further covers packages, interfaces, exception handling, and file I/O operations to enhance application robustness. Advanced topics include multithreading for concurrent execution and lambda expressions for functional-style programming. The course concludes with the Java Collections Framework and Stream API, enabling efficient manipulation of object groups and data processing. Emphasis is placed on applying Java features to solve real-world programming problems effectively.",
    "course_outcomes": [
      "Understand Java's history, features, object-oriented concepts, control statements, and basic data types.",
      "Apply concepts of classes, objects, inheritance, and string handling to develop Java applications.",
      "Apply the concepts of packages, interfaces, exception handling, and I/O streams to develop efficient and modular Java programs.",
      "Apply multithreading and lambda expressions in Java to develop efficient, concurrent, and functional programs.",
      "Apply Java Collections Framework and Stream API for managing groups of objects and performing efficient operations on them."
    ],
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Fundamental Java Programming Constructs",
        "topics": "The History and Evolution of Java, Java Features, Object Oriented Programming principles. Data Types, Variables and Arrays, Operators."
      },
      {
        "unit_number": "2",
        "title": "Classes, Objects, Inheritance, and String Handling",
        "topics": "Introducing Classes and Objects, Constructors, 'this' keyword, static, final. String Handling: String Constructors, StringBuffer Class, StringTokenizer class. Inheritance: Basics, 'super', Method Overriding, Dynamic Method Dispatch, Abstract Classes."
      },
      {
        "unit_number": "3",
        "title": "Packages and Interfaces, Exception Handling, and IO Streams",
        "topics": "Packages & Interfaces, Exception handling: Fundamentals, try, catch, throw, throws, finally, Custom Exceptions. I/O streams: The Byte Streams (InputStream, OutputStream) and The Character Streams (Reader, Writer)."
      },
      {
        "unit_number": "4",
        "title": "Multithreading and Lambda Expressions",
        "topics": "Multithreaded Programming: The Java Thread Model, Creating a Thread, Thread Priorities, Synchronization. Lambda Expressions: Introduction, Block Lambda Expressions, Generic Functional Interfaces, Method References."
      },
      {
        "unit_number": "5",
        "title": "Collections Framework and Stream API",
        "topics": "Collections Framework: Overview, List, Set, Map interfaces, ArrayList, LinkedList, HashSet, HashMap, TreeMap Classes. The Stream API: Stream Basics, Reduction Operations, Parallel Streams, Mapping, Collecting, Iterators and Streams."
      }
    ],
    "books": {
      "textbooks": [
        "Herbert Schildt, Danny Coward, \"Java: The Complete Reference\", Thirteenth Edition, McGrawHill, 2023."
      ],
      "reference_books": [
        "Herbert Schildt, Dale Skrien, \"Java Fundamentals A Comprehension Introduction\", Special Indian Edition, McGraw-Hill Education India Pvt. Ltd, 2017.",
        "E Balaguruswamy, \"Programming with Java\", Seventh Edition, Mc Graw Hill 2023.",
        "Paul J. Dietel and Dr.Harvey M. Deitel, \"Java How to Program\", Eleventh Edition, Deitel & Associates, Inc.1, 2018."
      ],
      "web_resources": [
        "https://archive.nptel.ac.in/courses/106/105/106105191/",
        "https://onlinecourses.nptel.ac.in/noc24_cs96/preview",
        "https://www.coursera.org/specializations/java-programming",
        "https://www.coursera.org/specializations/hands-on-java"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "24CS203",
      "course_name": "Software Engineering",
      "semester": "3",
      "category": "Professional Core (PC)",
      "credits": 3,
      "L-T-P": "3-0-0",
      "course_type": "Theory",
      "prerequisites": "Not specified"
    },
    "course_description": "This course provides an overview of the software engineering discipline, introducing the student to the fundamental principles and methods in software engineering. The course teaches various methods and models to gather, analyze, and model system requirements. Design methodologies including structured and object-oriented design are also covered. Students will learn the implementation and testing concepts in developing a successful software solution.",
    "course_outcomes": [
      "Understand the basics of software engineering.",
      "Understand the different software engineering process models.",
      "Apply analysis model for any given application.",
      "Apply design model for any given application.",
      "Apply different testing techniques."
    ],
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Process Models and Agile Development",
        "topics": "Introduction: The Nature of Software, The Software Process, Software Engineering Practice, Software Development Myths. Process models: Prescriptive, Specialized, Unified, Personal and Team Process Models. Agile Development: Agility, Agile Process, Extreme Programming (XP), Other Agile Process Models."
      },
      {
        "unit_number": "2",
        "title": "Requirements Engineering",
        "topics": "Understanding Requirements: Requirements Engineering, Eliciting Requirements, Developing Use Cases, Building the Analysis Model, Negotiating and Validating Requirements. Requirements Modeling: Scenario Based Methods, UML Models, Class-based methods, Class-Responsibility-Collaborator Modeling."
      },
      {
        "unit_number": "3",
        "title": "Requirements Modeling & Design Concepts",
        "topics": "Requirements Modeling (Flow and Behavior): Creating a Behavioral Model, Identifying events with Use Cases, State Representations, Patterns for Requirements Modeling. Design Concepts: The Design Process, Design Concepts, the Design Model."
      },
      {
        "unit_number": "4",
        "title": "Software Design",
        "topics": "Architectural Design: Software Architecture, Architectural Styles, Architectural Decisions. Component-Level Design: Designing Class-Based Components, Component level design for Web and Mobile Apps. User Interface Design: The Golden Rules, User Interface Analysis and Design Steps."
      },
      {
        "unit_number": "5",
        "title": "Software Testing",
        "topics": "Software Testing Strategies: A Strategic Approach, Test Strategies for Conventional and Object-Oriented Software. Testing Conventional Applications: White Box Testing, Basis Path Testing, Control Structure Testing, Black-Box Testing."
      }
    ],
    "books": {
      "textbooks": [
        "Roger S. Pressman, Bruce R.Maxim, \"Software Engineering a practitioners approach\" 8th edition, McGraw-Hill Publication, 2019."
      ],
      "reference_books": [
        "Ian Somerville, \"Software Engineering\". 9th ed, Pearson Education. 2011.",
        "Carlo Ghezzi, Mehdi Jazayeri and Dino Mandrioli, \"Fundamentals of Software Engineering\".2 ed, PHI. 2009.",
        "RajibMall, Fundamentals of Software Engineering. 3 ed. PHI. 2009."
      ],
      "web_resources": [
        "https://nptel.ac.in/courses/106101061/2",
        "https://onlinecourses.swayam2.ac.in/cec20_cs07/preview",
        "https://www.youtube.com/watch?v=sB2iQSvrcGO"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "24CS204",
      "course_name": "Operating Systems",
      "semester": "3",
      "category": "Program Core (PC)",
      "credits": 4,
      "L-T-P": "3-0-2",
      "course_type": "Theory",
      "prerequisites": "Programming using 'C'"
    },
    "course_description": "This course provides a comprehensive introduction to the underlying principles, techniques and approaches which constitute a coherent body of knowledge in operating systems. The emphasis of the course will be placed on understanding how the various elements that constitute an operating system interact and provides services for execution of application software.",
    "course_outcomes": [
      "Identify the basic components of an Operating System engineering.",
      "Apply CPU Scheduling and disk scheduling algorithms to achieve specific criteria.",
      "Apply analysis model for any given application.",
      "Analyze the mechanisms used for process synchronization and handling deadlocks.",
      "Analyze virtual memory techniques & File system Implementation techniques."
    ],
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Introduction and Operating System Structures",
        "topics": "Operating Systems, Computer-System Organization and Architecture, Operating-System Operations, Distributed Systems. Operating-System Services, User and Operating-System Interface, System Calls, System Services, OS Design and Implementation, OS Structure, Building and Booting an OS."
      },
      {
        "unit_number": "2",
        "title": "Process Management",
        "topics": "Processes and Threads: Process Concept, Scheduling, Operations on Processes, Interprocess Communication (IPC), Multithreading Models. CPU Scheduling: Basic Concepts, Criteria, Algorithms (FCFS, SJF, RR, Priority, etc.), Multi-Processor Scheduling."
      },
      {
        "unit_number": "3",
        "title": "Process Synchronization",
        "topics": "Synchronization Tools: The Critical-Section Problem, Peterson's Solution, Hardware Support, Mutex Locks, Semaphores, Monitors, Classic Problems of Synchronization. Deadlocks: System Model, Characterization, Methods for Handling (Prevention, Avoidance, Detection, Recovery)."
      },
      {
        "unit_number": "4",
        "title": "Memory Management",
        "topics": "Main Memory: Contiguous Memory Allocation, Paging, Structure of the Page Table, Swapping. Virtual Memory: Demand Paging, Copy-on-Write, Page Replacement, Allocation of Frames, Thrashing."
      },
      {
        "unit_number": "5",
        "title": "Storage Management and File System",
        "topics": "Mass-Storage Structure: HDD Scheduling (FCFS, SCAN, C-SCAN), RAID Structure. File-System Interface & Implementation: File Concept, Access Methods, Directory Structure, File-System Operations, Allocation Methods. File-System Internals: File-System Mounting, Partitions, File Sharing."
      }
    ],
    "lab_tasks": [
      "Introduction to Linux Command Line Interface and Shell Utilities.",
      "Practicing Essential Windows PowerShell Commands Using Batch Scripts.",
      "Implementation of Fundamental UNIX System Calls for Process and File System Management.",
      "Simulation of FCFS, SJF (Preemptive & Non-Preemptive), Round Robin Scheduling Algorithms.",
      "Simulation of Priority Scheduling (Preemptive & Non-Preemptive).",
      "Real-Time Scheduling EDF and Rate Monotonic Scheduling (RMS).",
      "Simulating the Critical Section Problem & Implementing Peterson's Solution.",
      "Implementing Producer-Consumer Problem using Semaphores.",
      "Solving Readers-writers problem using synchronization tools.",
      "Solving the Dining Philosophers Problem.",
      "Simulate Banker's Algorithm for Deadlock Avoidance.",
      "Simulate memory allocation strategies like First Fit, Best Fit, and Worst Fit.",
      "Simulate logical to physical address translation using fixed-size pages and frames.",
      "Implement and compare FIFO, LRU, and Optimal page replacement algorithms.",
      "Simulate disk scheduling algorithms like FCFS, SSTF, SCAN, C-SCAN.",
      "Simulate and compare File Allocation Methods (Contiguous, Linked, Indexed).",
      "Implement free space tracking methods: Bit vector, Linked list & Grouping."
    ],
    "books": {
      "textbooks": [
        "Abraham Silberschatz, Peter B. Galvin and Greg Gagne, \"Operating System Concepts\", 10th Edition, John Wiley & Sons Pvt. Ltd, 2018."
      ],
      "reference_books": [
        "William Stallings, \"Operating System: Internals and Design Principles\", 6thEdition 2009.",
        "Andrew S.Tanenbaum, \"Modern Operating Systems\", 3rdEdition, PHI, 2008."
      ],
      "web_resources": [
        "https://nptel.ac.in/courses/106/105/106105214/",
        "https://www.scs.stanford.edu/21wi-cs140/notes/",
        "https://www.cse.iitb.ac.in/-mythili/os/"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "24CS281",
      "course_name": "Object Oriented Programming Through Java Lab",
      "semester": "3",
      "category": "Program Core (PC)",
      "credits": 1.5,
      "L-T-P": "0-0-3",
      "course_type": "Practical",
      "prerequisites": "Programming using 'C' Lab"
    },
    "course_description": "The course provides hands-on experience in developing applications using Java, focusing on core and advanced object-oriented programming concepts. It guides students through writing, compiling, and executing Java programs covering control statements, OOP principles, inheritance, exception handling, multithreading, lambda expressions, and the Java Collections Framework. This lab course is designed to strengthen programming skills and prepare students for developing scalable, maintainable Java applications in real-world scenarios.",
    "course_outcomes": [
      "Apply the basic concepts of Java including installation, data types, control statements, and arrays.",
      "Apply OOP principles, string handling and inheritance.",
      "Apply the concepts of packages, interfaces, exception handling, and stream-based file input/output.",
      "Apply the concepts of multithreading and lambda expressions.",
      "Apply the concepts of Java collections framework and Stream API."
    ],
    "syllabus": {
      "list_of_tasks": [
        "Task 1: Installation, Simple Program and Control Statements",
        "Task 2: Primitive Types, Type Conversions and Type Promotions",
        "Task 3: Arrays",
        "Task 4: Classes, Objects and Constructors",
        "Task 5: Method Overloading and String Handling",
        "Task 6: Inheritance, Method Overriding and Dynamic Method Dispatch",
        "Task 7: Packages, Interfaces and Exceptions",
        "Task 8: Byte Streams and Character Streams",
        "Task 9: Threads, Multiple Threads and Thread Priorities",
        "Task 10: Generic Functional Interfaces and Lambda Expressions",
        "Task 11: Collection Classes (ArrayList, LinkedList, HashSet, HashMap, TreeMap)",
        "Task 12: The Stream API"
      ]
    },
    "books": {
      "textbooks": [
        "Herbert Schildt, Danny Coward, \"Java: The Complete Reference\", Thirteenth Edition, McGrawHill, 2023."
      ],
      "reference_books": [
        "Herbert Schildt, Dale Skrien, \"Java Fundamentals A Comprehension Introduction\", Special Indian Edition, McGraw-Hill Education India Pvt. Ltd, 2017.",
        "E Balaguruswamy, \"Programming with Java\", Seventh Edition, Mc Graw Hill 2023.",
        "Paul J. Dietel and Dr.Harvey M. Deitel, \"Java How to Program\", Eleventh Edition, Deitel & Associates, Inc.1, 2018."
      ],
      "web_resources": [
        "https://archive.nptel.ac.in/courses/106/105/106105191/",
        "https://onlinecourses.nptel.ac.in/noc24_cs96/preview",
        "https://www.coursera.org/specializations/java-programming",
        "https://www.coursera.org/specializations/hands-on-java"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "24CS282",
      "course_name": "Digital Logic Design Lab",
      "semester": "3",
      "category": "Engineering Sciences (ES)",
      "credits": 1.5,
      "L-T-P": "0-0-3",
      "course_type": "Practical",
      "prerequisites": "Not specified"
    },
    "course_description": "This laboratory component is designed to help students gain practical experience in implementing digital circuits and systems based on the theory learned in the classroom. The experiments cover a wide range of topics, from basic logic gates to more complex combinational and sequential circuits, and also introduce the use of FPGA for digital design.",
    "course_outcomes": [
      "Apply knowledge of logic gates and universal gates for circuit realization.",
      "Apply combinational logic concepts to design arithmetic circuits, code converters, and comparators.",
      "Analyze combinational circuits using MSIs such as multiplexers, decoders, and encoders.",
      "Analyze various types of flip-flops, counters, and shift registers.",
      "Analyze logic gate realization and combinational circuit design using FPGA platforms."
    ],
    "syllabus": {
      "list_of_tasks": [
        "Task 1: Realization of All logic gates using universal gates.",
        "Task 2: Design and Implementation of Arithmetic circuits (half adder, half subtractor).",
        "Task 3: Design and implement different types of code converters (Binary to Gray, BCD to EX-3).",
        "Task 4: Design and implementation of magnitude comparators.",
        "Task 5: Implementation of Decoders and encoders.",
        "Task 6: Implementation of Multiplexer and De Multiplexer.",
        "Task 7: Implementation of all types of FLIP-FLOPS using gates.",
        "Task 8: Design of Synchronous counters.",
        "Task 9: Design of Asynchronous counters.",
        "Task 10: Design of Ring-counter and Johnson counter.",
        "Task 11: Verification of Shift-Registers using flip flops.",
        "Task 12: Logic Design with FPGA (Xilinx Spartan-6)."
      ]
    },
    "books": {
      "textbooks": [
        "M.Morris Mano, Digital Logic & Computer Design 1 e/d reprint, Pearson education, 2016",
        "M.Morris Mano, Michael D Ciletti Digital Design with an Introduction to Verilog HDL 5th e/d, Pearson education, 2013"
      ],
      "reference_books": [
        "A. Anand Kumar, Switching Theory and Logic Design, 2nd Edition, PHI, 2013",
        "Charles H.Roth, Fundamentals of Logic Design, 6/e, Cengage learning, 2010",
        "Computer Architecture and Organization Designing for Performance, William Stallings, Ninth edition, Pearson Education series, 2014."
      ],
      "web_resources": [
        "https://nptel.ac.in/courses/108/106/108106177/",
        "https://nptel.ac.in/courses/106/108/106108099/"
      ]
    }
  },
  {
    "metadata": {
      "course_code": "24UC201",
      "course_name": "Universal Human Values-II",
      "semester": "3",
      "category": "Mandatory Course (MC)",
      "credits": 3,
      "L-T-P": "2-1-0",
      "course_type": "Theory",
      "prerequisites": "UHV-I (Student Induction Programme)"
    },
    "course_description": "The course is mandated by AICTE and is intended to facilitate the development of a holistic and humane world vision. This course employs an innovative and effective methodology of self-exploration and self-verification. It is presented as a systematic set of universal, rational and verifiable proposals about human reality, and the inherent harmony in the human being, the family, society, nature, and existence. The issues in professional ethics are analyzed in the context of the understanding of harmony.",
    "course_outcomes": [
      "Apply the right understanding of the concepts of value education and basic human aspirations through self-exploration for the fulfillment of human aspirations.",
      "Analyse various aspects of the human being as the combination of Self and Body for attaining harmony at the level of human being (individual).",
      "Apply the knowledge of nine universal values in human-human relationship for harmony at the level of family, and appreciate all the essential factors that help in attaining harmony at the level of society.",
      "Differentiate the characteristics and activities of various orders of Nature and study the mutual fulfillment among them, and also identify the existence as co-existence at all levels.",
      "Present sustainable solutions to various challenges in society and Nature, and identify that the solutions are practicable."
    ],
    "syllabus": [
      {
        "unit_number": "1",
        "title": "Introduction, Need, and Basic Guidelines",
        "topics": "Purpose and Motivation for the course, Self-exploration, 'Natural acceptance' and experimental validation. Continuous happiness and prosperity. Right understanding, relationship and physical facility. Understanding happiness and prosperity correctly."
      },
      {
        "unit_number": "2",
        "title": "Understanding Harmony in the Human Being - Harmony in Myself",
        "topics": "Understanding human being as a co-existence of the sentient 'I' and the material 'Body'. Understanding the needs of Self ('I') and 'Body'. Understanding the Body as an instrument of 'I'. Understanding the harmony of I with the Body: Sanyam and Health, meaning of Prosperity."
      },
      {
        "unit_number": "3",
        "title": "Understanding Harmony in the Family and Society - Harmony in Human-Human Relationship",
        "topics": "Understanding values in human-human relationship; meaning of Justice (nine universal values). Trust and Respect as the foundational values. Understanding the harmony in the society; Resolution, Prosperity, fearlessness (trust) and co-existence as comprehensive Human Goals."
      },
      {
        "unit_number": "4",
        "title": "Understanding Harmony in Nature & Existence - Whole existence as Coexistence",
        "topics": "Understanding the harmony in the Nature, Inter-connectedness and mutual fulfillment among the four orders of Nature. Understanding Existence as Co-existence of mutually interacting units in all-pervasive space."
      },
      {
        "unit_number": "5",
        "title": "Implications of the above Holistic Understanding of Harmony on Professional Ethics",
        "topics": "Natural acceptance of human values, Definitiveness of ethical human conduct. Competence in professional ethics: ability to identify and develop people-friendly and eco-friendly production systems. Case studies of holistic technologies and management models. Strategy for transition to Universal Human Order."
      }
    ],
    "books": {
      "textbooks": [
        "R.R. Gaur, R. Sangal, G.P. Bagaria, A Foundation Course in Human Values and Professional Ethics, Excel Books Private Limited, New Delhi, 2010.",
        "R.R. Gaur, R. Asthana, G.P. Bagaria, A Foundation Course in Human Values and Professional Ethics (2nd revised ed.), Excel Books Private Limited, New Delhi, 2019."
      ],
      "reference_books": [
        "A. Nagaraj, Jeevan Vidya: Ek Parichaya, Jeevan Vidya Prakashan, Amarkantak, 1999.",
        "A.N. Tripathi, Human Values, New Age International Publishers, New Delhi, 2004.",
        "Annie Leonard, The Story of Stuff: The Impact of Overconsumption on the Planet, Our Communities, and Our Health and How We Can Make It Better, Free Press, New York, 2010.",
        "Mohandas Karamchand Gandhi, The Story of My Experiments with Truth: Mahatma Gandhi Autobiography, B.N. Publishing, 2008.",
        "E.F. Schumacher, Small is Beautiful: A Study of Economics as if People Mattered, Vintage Books, London, 1993."
      ],
      "web_resources": [
        "https://dokumen.pub/a-foundation-course-in-human-values-and-professional-ethics-firstnbsped-9788174467812.html",
        "https://www.youtube.com/channel/UCo8MpJB_aaVwB4LWLAx6AhQ",
        "https://fdp-si.aicte-india.org/download.php#1"
      ]
    }
  }
]